{
    "data": [
        {
            "_id": "5114",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/1223/96541.jpg",
            "link": "https://myanimelist.net/anime/5114/Fullmetal_Alchemist__Brotherhood",
            "ranking": 1,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1223/96541.jpg?s=faffcb677a5eacd17bf761edd78bfb3f",
            "title": "Fullmetal Alchemist: Brotherhood",
            "hasRanking": true,
            "alternativeTitles": [
                "Hagane no Renkinjutsushi: Fullmetal Alchemist",
                "Fullmetal Alchemist (2009)",
                "FMA",
                "FMAB",
                "鋼の錬金術師 FULLMETAL ALCHEMIST",
                "Fullmetal Alchemist: Brotherhood",
                "Fullmetal Alchemist Brotherhood"
            ],
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "Fantasy"
            ],
            "episodes": 64,
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "After a horrific alchemy experiment goes wrong in the Elric household, brothers Edward and Alphonse are left in a catastrophic new reality. Ignoring the alchemical principle banning human transmutation, the boys attempted to bring their recently deceased mother back to life. Instead, they suffered brutal personal loss: Alphonse's body disintegrated while Edward lost a leg and then sacrificed an arm to keep Alphonse's soul in the physical realm by binding it to a hulking suit of armor.\n\nThe brothers are rescued by their neighbor Pinako Rockbell and her granddaughter Winry. Known as a bio-mechanical engineering prodigy, Winry creates prosthetic limbs for Edward by utilizing \"automail,\" a tough, versatile metal used in robots and combat armor. After years of training, the Elric brothers set off on a quest to restore their bodies by locating the Philosopher's Stone—a powerful gem that allows an alchemist to defy the traditional laws of Equivalent Exchange.\n\nAs Edward becomes an infamous alchemist and gains the nickname \"Fullmetal,\" the boys' journey embroils them in a growing conspiracy that threatens the fate of the world.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "28977",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/3/72078.jpg",
            "link": "https://myanimelist.net/anime/28977/Gintama%C2%B0",
            "ranking": 2,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/3/72078.jpg?s=e9537ac90c08758594c787ede117f209",
            "title": "Gintama°",
            "hasRanking": true,
            "alternativeTitles": [
                "Gintama' (2015)",
                "銀魂°",
                "Gintama Season 4",
                "Gintama Season 4",
                "Gintama Temporada 4",
                "Gintama Saison 4"
            ],
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "episodes": 51,
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Gintoki, Shinpachi, and Kagura return as the fun-loving but broke members of the Yorozuya team! Living in an alternate-reality Edo, where swords are prohibited and alien overlords have conquered Japan, they try to thrive on doing whatever work they can get their hands on. However, Shinpachi and Kagura still haven't been paid... Does Gin-chan really spend all that cash playing pachinko?\n\nMeanwhile, when Gintoki drunkenly staggers home one night, an alien spaceship crashes nearby. A fatally injured crew member emerges from the ship and gives Gintoki a strange, clock-shaped device, warning him that it is incredibly powerful and must be safeguarded. Mistaking it for his alarm clock, Gintoki proceeds to smash the device the next morning and suddenly discovers that the world outside his apartment has come to a standstill. With Kagura and Shinpachi at his side, he sets off to get the device fixed; though, as usual, nothing is ever that simple for the Yorozuya team.\n\nFilled with tongue-in-cheek humor and moments of heartfelt emotion, Gintama's fourth season finds Gintoki and his friends facing both their most hilarious misadventures and most dangerous crises yet.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "9253",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/5/73199.jpg",
            "link": "https://myanimelist.net/anime/9253/Steins_Gate",
            "ranking": 3,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/5/73199.jpg?s=97b97d568f25a02cf5a22dda13b5371f",
            "title": "Steins;Gate",
            "hasRanking": true,
            "alternativeTitles": [
                "STEINS;GATE",
                "Steins;Gate"
            ],
            "genres": [
                "Drama",
                "Sci-Fi",
                "Suspense"
            ],
            "episodes": 24,
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Eccentric scientist Rintarou Okabe has a never-ending thirst for scientific exploration. Together with his ditzy but well-meaning friend Mayuri Shiina and his roommate Itaru Hashida, Rintarou founds the Future Gadget Laboratory in the hopes of creating technological innovations that baffle the human psyche. Despite claims of grandeur, the only notable \"gadget\" the trio have created is a microwave that has the mystifying power to turn bananas into green goo.\n\nHowever, when Rintarou decides to attend neuroscientist Kurisu Makise's conference on time travel, he experiences a series of strange events that lead him to believe that there is more to the \"Phone Microwave\" gadget than meets the eye. Apparently able to send text messages into the past using the microwave, Rintarou dabbles further with the \"time machine,\" attracting the ire and attention of the mysterious organization SERN.\n\nDue to the novel discovery, Rintarou and his friends find themselves in an ever-present danger. As he works to mitigate the damage his invention has caused to the timeline, he is not only fighting a battle to save his loved ones, but also one against his degrading sanity.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "38524",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/1517/100633.jpg",
            "link": "https://myanimelist.net/anime/38524/Shingeki_no_Kyojin_Season_3_Part_2",
            "ranking": 4,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1517/100633.jpg?s=4540a01b5883647ade494cd28392f100",
            "title": "Shingeki no Kyojin Season 3 Part 2",
            "hasRanking": true,
            "alternativeTitles": [
                "進撃の巨人 Season3 Part.2",
                "Attack on Titan Season 3 Part 2",
                "Attack on Titan Staffel 3 Teil 2",
                "Ataque a los Titanes Temporada 3 Parte 2",
                "L'Attaque des Titans Saison 3 Partie 2"
            ],
            "genres": [
                "Action",
                "Drama"
            ],
            "episodes": 10,
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Seeking to restore humanity's diminishing hope, the Survey Corps embark on a mission to retake Wall Maria, where the battle against the merciless \"Titans\" takes the stage once again.\n\nReturning to the tattered Shiganshina District that was once his home, Eren Yeager and the Corps find the town oddly unoccupied by Titans. Even after the outer gate is plugged, they strangely encounter no opposition. The mission progresses smoothly until Armin Arlert, highly suspicious of the enemy's absence, discovers distressing signs of a potential scheme against them. \n\nShingeki no Kyojin Season 3 Part 2 follows Eren as he vows to take back everything that was once his. Alongside him, the Survey Corps strive—through countless sacrifices—to carve a path towards victory and uncover the secrets locked away in the Yeager family's basement.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "9969",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/4/50361.jpg",
            "link": "https://myanimelist.net/anime/9969/Gintama",
            "ranking": 5,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/4/50361.jpg?s=b3a061db8c3d42a055d58f9df1f3dac7",
            "title": "Gintama'",
            "hasRanking": true,
            "alternativeTitles": [
                "Gintama (2011)",
                "銀魂'",
                "Gintama Season 2",
                "Gintama Staffel 2",
                "Gintama Temporada 2",
                "Gintama Saison 2"
            ],
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "episodes": 51,
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "After a one-year hiatus, Shinpachi Shimura returns to Edo, only to stumble upon a shocking surprise: Gintoki and Kagura, his fellow Yorozuya members, have become completely different characters! Fleeing from the Yorozuya headquarters in confusion, Shinpachi finds that all the denizens of Edo have undergone impossibly extreme changes, in both appearance and personality. Most unbelievably, his sister Otae has married the Shinsengumi chief and shameless stalker Isao Kondou and is pregnant with their first child.\n\nBewildered, Shinpachi agrees to join the Shinsengumi at Otae and Kondou's request and finds even more startling transformations afoot both in and out of the ranks of the the organization. However, discovering that Vice Chief Toushirou Hijikata has remained unchanged, Shinpachi and his unlikely Shinsengumi ally set out to return the city of Edo to how they remember it.\n\nWith even more dirty jokes, tongue-in-cheek parodies, and shameless references, Gintama' follows the Yorozuya team through more of their misadventures in the vibrant, alien-filled world of Edo.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "39486",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/1988/113791.jpg",
            "link": "https://myanimelist.net/anime/39486/Gintama__The_Final",
            "ranking": 6,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1988/113791.jpg?s=e12ba155fe4a7beff571a5010d8214b2",
            "title": "Gintama: The Final",
            "hasRanking": true,
            "alternativeTitles": [
                "銀魂 THE FINAL",
                "Gintama: The Very Final",
                "N/A"
            ],
            "genres": [
                "Action",
                "Comedy",
                "Drama",
                "Sci-Fi"
            ],
            "episodes": 1,
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Two years have passed following the Tendoshuu's invasion of the O-Edo Central Terminal. Since then, the Yorozuya have gone their separate ways. Foreseeing Utsuro's return, Gintoki Sakata begins surveying Earth's ley lines for traces of the other man's Altana. After an encounter with the remnants of the Tendoshuu—who continue to press on in search of immortality—Gintoki returns to Edo.\n\nLater, the regrouped Shinsengumi and Yorozuya begin an attack on the occupied Central Terminal. With the Altana harvested by the wreckage of the Tendoshuu's ship in danger of detonating, the Yorozuya and their allies fight their enemies while the safety of Edo—and the rest of the world—hangs in the balance. Fulfilling the wishes of their teacher, Shouyou Yoshida's former students unite and relive their pasts one final time in an attempt to save their futures.\n\n[Written by MAL Rewrite]\n",
            "type": "Movie"
        },
        {
            "_id": "11061",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/1337/99013.jpg",
            "link": "https://myanimelist.net/anime/11061/Hunter_x_Hunter_2011",
            "ranking": 7,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1337/99013.jpg?s=1838e905a0aa3542a009fbcf78000701",
            "title": "Hunter x Hunter (2011)",
            "hasRanking": true,
            "alternativeTitles": [
                "HxH (2011)",
                "HUNTER×HUNTER（ハンター×ハンター）",
                "Hunter x Hunter",
                "Hunter x Hunter",
                "Hunter x Hunter",
                "Hunter X Hunter"
            ],
            "episodes": 148,
            "genres": [
                "Action",
                "Adventure",
                "Fantasy"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Hunters devote themselves to accomplishing hazardous tasks, all from traversing the world's uncharted territories to locating rare items and monsters. Before becoming a Hunter, one must pass the Hunter Examination—a high-risk selection process in which most applicants end up handicapped or worse, deceased.\n\nAmbitious participants who challenge the notorious exam carry their own reason. What drives 12-year-old Gon Freecss is finding Ging, his father and a Hunter himself. Believing that he will meet his father by becoming a Hunter, Gon takes the first step to walk the same path.\n\nDuring the Hunter Examination, Gon befriends the medical student Leorio Paladiknight, the vindictive Kurapika, and ex-assassin Killua Zoldyck. While their motives vastly differ from each other, they band together for a common goal and begin to venture into a perilous world.\n\n[Written by MAL Rewrite]\n\n",
            "type": "TV"
        },
        {
            "_id": "15417",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/1452/123686.jpg",
            "link": "https://myanimelist.net/anime/15417/Gintama__Enchousen",
            "ranking": 8,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1452/123686.jpg?s=9691ed28cdfeb56ce6881faf2adbf01e",
            "title": "Gintama': Enchousen",
            "hasRanking": true,
            "alternativeTitles": [
                "Gintama' (2012)",
                "Gintama' Overdrive",
                "Kintama",
                "銀魂' 延長戦",
                "Gintama: Enchousen"
            ],
            "episodes": 13,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "While Gintoki Sakata was away, the Yorozuya found themselves a new leader: Kintoki, Gintoki's golden-haired doppelganger. In order to regain his former position, Gintoki will need the help of those around him, a troubling feat when no one can remember him! Between Kintoki and Gintoki, who will claim the throne as the main character?\n\nIn addition, Yorozuya make a trip back down to red-light district of Yoshiwara to aid an elderly courtesan in her search for her long-lost lover. Although the district is no longer in chains beneath the earth's surface, the trio soon learn of the tragic backstories of Yoshiwara's inhabitants that still haunt them. With flashback after flashback, this quest has Yorozuya witnessing everlasting love and protecting it as best they can with their hearts and souls.\n\nGintama': Enchousen includes moments of action-packed intensity along with their usual lighthearted, slapstick humor for Gintoki and his friends.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "42938",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/1085/114792.jpg",
            "link": "https://myanimelist.net/anime/42938/Fruits_Basket__The_Final",
            "ranking": 9,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1085/114792.jpg?s=bb4303c0804c9d5ca9fcb30b8f8e6783",
            "title": "Fruits Basket: The Final",
            "hasRanking": true,
            "alternativeTitles": [
                "Fruits Basket 3rd Season",
                "Fruits Basket (2019) 3rd Season",
                "Furuba",
                "フルーツバスケット The Final",
                "Fruits Basket: The Final Season",
                "Fruits Basket Staffel 3",
                "Fruits Basket: The Final Season",
                "Fruits Basket Saison 3"
            ],
            "episodes": 13,
            "genres": [
                "Drama",
                "Romance",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Hundreds of years ago, the Chinese Zodiac spirits and their god swore to stay together eternally. United by this promise, the possessed members of the Souma family shall always return to each other under any circumstances. Yet, when these bonds shackle them from freedom, it becomes an undesirable burden—a curse. As head of the clan, Akito is convinced that he shares a special connection with the other Soumas. While he desperately clings to this fantasy, the rest of the family remains isolated and suppressed by the fear of punishment.\n\nTooru Honda, who has grown attached to the Soumas, is determined to break the chains that bind them. Her companionship with the family and her friends encourages her to move forward with lifting the curse. However, due to confounding revelations, she struggles to find the tenacity to continue her endeavors. With time slowly withering away, Tooru contends with an uncertain future in hopes of reaching the tranquility that may lie beyond all this commotion.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "820",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/13/13225.jpg",
            "link": "https://myanimelist.net/anime/820/Ginga_Eiyuu_Densetsu",
            "ranking": 10,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/13/13225.jpg?s=385cedad342e284c5765833ab1cddc1c",
            "title": "Ginga Eiyuu Densetsu",
            "hasRanking": true,
            "alternativeTitles": [
                "LoGH",
                "LotGH",
                "Gin'eiden",
                "GinEiDen",
                "Heldensagen Vom Kosmosinsel",
                "銀河英雄伝説",
                "Legend of the Galactic Heroes",
                "Les Héros de la Galaxie"
            ],
            "episodes": 110,
            "genres": [
                "Drama",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "The 150-year-long stalemate between the two interstellar superpowers, the Galactic Empire and the Free Planets Alliance, comes to an end when a new generation of leaders arises: the idealistic military genius Reinhard von Lohengramm, and the FPA's reserved historian, Yang Wenli.\n\nWhile Reinhard climbs the ranks of the Empire with the aid of his childhood friend, Siegfried Kircheis, he must fight not only the war, but also the remnants of the crumbling Goldenbaum Dynasty in order to free his sister from the Kaiser and unify humanity under one genuine ruler. Meanwhile, on the other side of the galaxy, Yang—a strong supporter of democratic ideals—has to stand firm in his beliefs, despite the struggles of the FPA, and show his pupil, Julian Mintz, that autocracy is not the solution.\n\nAs ideologies clash amidst the war's many casualties, the two strategic masterminds must ask themselves what the real reason behind their battle is.\n\n[Written by MAL Rewrite]",
            "type": "OVA"
        },
        {
            "_id": "50265",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/1441/122795.jpg",
            "link": "https://myanimelist.net/anime/50265/Spy_x_Family",
            "ranking": 11,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1441/122795.jpg?s=ba5838dcfffe4a5cd4988e09d8436c79",
            "title": "Spy x Family",
            "hasRanking": true,
            "alternativeTitles": [
                "SPY×FAMILY"
            ],
            "genres": [
                "Action",
                "Comedy"
            ],
            "episodes": 12,
            "hasEpisode": true,
            "status": "Currently Airing",
            "synopsis": "Corrupt politicians, frenzied nationalists, and other warmongering forces constantly jeopardize the thin veneer of peace between neighboring countries Ostania and Westalis. In spite of their plots, renowned spy and master of disguise \"Twilight\" fulfills dangerous missions one after another in the hope that no child will have to experience the horrors of war.\n\nIn the bustling Ostanian city of Berlint, Twilight dons the alias of \"Loid Forger,\" an esteemed psychiatrist. However, his true intention is to gather intelligence on prominent politician Donovan Desmond, who only appears rarely in public at his sons' school: the prestigious Eden Academy. Enlisting the help of unmarried city hall clerk Yor Briar to act as his wife and adopting the curious six-year-old orphan Anya as his daughter, Loid enacts his master plan. He will enroll Anya in Eden Academy, where Loid hopes she will excel and give him the opportunity to meet Donovan without arousing suspicion. \n\nUnfortunately for Loid, even a man of his talents has trouble playing the figure of a loving father and husband. And just like Loid is hiding his true identity, Yor—who is an underground assassin known as \"Thorn Princess\"—and Anya—an esper who can read people's minds—have no plans to disclose their own secrets either. Although this picture-perfect family is founded on deception, the Forgers gradually come to understand that the love they share for one another trumps all else.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "34096",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/3/83528.jpg",
            "link": "https://myanimelist.net/anime/34096/Gintama",
            "ranking": 12,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/3/83528.jpg?s=948f092dd55fb2572f38a0e21f03b642",
            "title": "Gintama.",
            "hasRanking": true,
            "alternativeTitles": [
                "Gintama (2017)",
                "銀魂。",
                "Gintama Season 5"
            ],
            "episodes": 12,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "After joining the resistance against the bakufu, Gintoki and the gang are in hiding, along with Katsura and his Joui rebels. The Yorozuya is soon approached by Nobume Imai and two members of the Kiheitai, who explain that the Harusame pirates have turned against 7th Division Captain Kamui and their former ally Takasugi. The Kiheitai present Gintoki with a job: find Takasugi, who has been missing since his ship was ambushed in a Harusame raid. Nobume also makes a stunning revelation regarding the Tendoushuu, a secret organization pulling the strings of numerous factions, and their leader Utsuro, the shadowy figure with an uncanny resemblance to Gintoki's former teacher.\n\nHitching a ride on Sakamoto's space ship, the Yorozuya and Katsura set out for Rakuyou, Kagura's home planet, where the various factions have gathered and tensions are brewing. Long-held grudges, political infighting, and the Tendoushuu's sinister overarching plan finally culminate into a massive, decisive battle on Rakuyou.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "43608",
            "__v": 2,
            "image": "https://cdn.myanimelist.net/images/anime/1160/122627.jpg",
            "link": "https://myanimelist.net/anime/43608/Kaguya-sama_wa_Kokurasetai__Ultra_Romantic",
            "ranking": 13,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1160/122627.jpg?s=9b41450e9598d10c97fb4eeb7cca3737",
            "title": "Kaguya-sama wa Kokurasetai: Ultra Romantic",
            "hasRanking": true,
            "alternativeTitles": [
                "Kaguya-sama wa Kokurasetai: Tensai-tachi no Renai Zunousen 3rd Season",
                "Kaguya-sama: Love is War Season 3rd Season",
                "かぐや様は告らせたい-ウルトラロマンティック-",
                "Kaguya-sama: Love is War - Ultra Romantic"
            ],
            "episodes": 12,
            "genres": [
                "Comedy",
                "Suspense"
            ],
            "hasEpisode": true,
            "status": "Currently Airing",
            "synopsis": "The elite members of Shuchiin Academy's student council continue their competitive day-to-day antics. Council president Miyuki Shirogane clashes daily against vice-president Kaguya Shinomiya, each fighting tooth and nail to trick the other into confessing their romantic love. Kaguya struggles within the strict confines of her wealthy, uptight family, rebelling against her cold default demeanor as she warms to Shirogane and the rest of her friends.\n\nMeanwhile, council treasurer Yuu Ishigami suffers under the weight of his hopeless crush on Tsubame Koyasu, a popular upperclassman who helps to instill a new confidence in him. Miko Iino, the newest student council member, grows closer to the rule-breaking Ishigami while striving to overcome her own authoritarian moral code.\n\nAs love further blooms at Shuchiin Academy, the student council officers drag their outsider friends into increasingly comedic conflicts.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "35180",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/3/88469.jpg",
            "link": "https://myanimelist.net/anime/35180/3-gatsu_no_Lion_2nd_Season",
            "ranking": 14,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/3/88469.jpg?s=becfbf556902bc3501e06a07354b9d76",
            "title": "3-gatsu no Lion 2nd Season",
            "hasRanking": true,
            "alternativeTitles": [
                "Sangatsu no Lion Second Season",
                "3月のライオン 第2シリーズ",
                "March Comes In Like A Lion 2nd Season",
                "March Come in Like a Lion Staffel 2",
                "March Comes in like a Lion Temporada 2",
                "March Comes in like a Lion Saison 2"
            ],
            "episodes": 22,
            "genres": [
                "Drama",
                "Slice of Life"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Now in his second year of high school, Rei Kiriyama continues pushing through his struggles in the professional shogi world as well as his personal life. Surrounded by vibrant personalities at the shogi hall, the school club, and in the local community, his solitary shell slowly begins to crack. Among them are the three Kawamoto sisters—Akari, Hinata, and Momo—who forge an affectionate and familial bond with Rei. Through these ties, he realizes that everyone is burdened by their own emotional hardships and begins learning how to rely on others while supporting them in return. \n\nNonetheless, the life of a professional is not easy. Between tournaments, championships, and title matches, the pressure mounts as Rei advances through the ranks and encounters incredibly skilled opponents. As he manages his relationships with those who have grown close to him, the shogi player continues to search for the reason he plays the game that defines his career.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "918",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/10/73274.jpg",
            "link": "https://myanimelist.net/anime/918/Gintama",
            "ranking": 15,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/10/73274.jpg?s=ed42453c10ba12b03b1600d02725a174",
            "title": "Gintama",
            "hasRanking": true,
            "alternativeTitles": [
                "Gin Tama",
                "Silver Soul",
                "Yorinuki Gintama-san",
                "銀魂",
                "Gintama"
            ],
            "episodes": 201,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Edo is a city that was home to the vigor and ambition of samurai across the country. However, following feudal Japan's surrender to powerful aliens known as the \"Amanto,\" those aspirations now seem unachievable. With the once-influential shogunate rebuilt as a puppet government, a new law is passed that promptly prohibits all swords in public. \n\nEnter Gintoki Sakata, an eccentric silver-haired man who always carries around a wooden sword and maintains his stature as a samurai despite the ban. As the founder of Yorozuya, a small business for odd jobs, Gintoki often embarks on endeavors to help other people—though usually in rather strange and unforeseen ways. \n\nAssisted by Shinpachi Shimura, a boy with glasses supposedly learning the way of the samurai; Kagura, a tomboyish girl with superhuman strength and an endless appetite; and Sadaharu, their giant pet dog who loves biting on people's heads, the Yorozuya encounter anything from alien royalty to scuffles with local gangs in the ever-changing world of Edo.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "28851",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1122/96435.jpg",
            "link": "https://myanimelist.net/anime/28851/Koe_no_Katachi",
            "ranking": 16,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1122/96435.jpg?s=56d2750d600af93a5d326daec7748cae",
            "title": "Koe no Katachi",
            "hasRanking": true,
            "alternativeTitles": [
                "The Shape of Voice",
                "聲の形",
                "A Silent Voice",
                "A Silent Voice",
                "Una Voz Silenciosa",
                "A Silent Voice"
            ],
            "episodes": 1,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "As a wild youth, elementary school student Shouya Ishida sought to beat boredom in the cruelest ways. When the deaf Shouko Nishimiya transfers into his class, Shouya and the rest of his class thoughtlessly bully her for fun. However, when her mother notifies the school, he is singled out and blamed for everything done to her. With Shouko transferring out of the school, Shouya is left at the mercy of his classmates. He is heartlessly ostracized all throughout elementary and middle school, while teachers turn a blind eye.\n\nNow in his third year of high school, Shouya is still plagued by his wrongdoings as a young boy. Sincerely regretting his past actions, he sets out on a journey of redemption: to meet Shouko once more and make amends.\n\nKoe no Katachi tells the heartwarming tale of Shouya's reunion with Shouko and his honest attempts to redeem himself, all while being continually haunted by the shadows of his past.\n \n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "37987",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1825/110716.jpg",
            "link": "https://myanimelist.net/anime/37987/Violet_Evergarden_Movie",
            "ranking": 17,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1825/110716.jpg?s=3ad8359182d0b47905f28d0a68683171",
            "title": "Violet Evergarden Movie",
            "hasRanking": true,
            "alternativeTitles": [
                "Gekijouban Violet Evergarden",
                "劇場版 ヴァイオレット・エヴァーガーデン",
                "Violet Evergarden the Movie",
                "Violet Evergarden: La película",
                "Violet Evergarden: Le film"
            ],
            "episodes": 1,
            "genres": [
                "Drama",
                "Fantasy",
                "Slice of Life"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Several years have passed since the end of The Great War. As the radio tower in Leidenschaftlich continues to be built, telephones will soon become more relevant, leading to a decline in demand for \"Auto Memory Dolls.\" Even so, Violet Evergarden continues to rise in fame after her constant success with writing letters. However, sometimes the one thing you long for is the one thing that does not appear.\n\nViolet Evergarden Movie follows Violet as she continues to comprehend the concept of emotion and the meaning of love. At the same time, she pursues a glimmer of hope that the man who once told her, \"I love you,\" may still be alive even after the many years that have passed.\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "4181",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1299/110774.jpg",
            "link": "https://myanimelist.net/anime/4181/Clannad__After_Story",
            "ranking": 18,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1299/110774.jpg?s=fcd9db2cfd72c10a2278f483173cfff9",
            "title": "Clannad: After Story",
            "hasRanking": true,
            "alternativeTitles": [
                "CLANNAD〜AFTER STORY〜 クラナド アフターストーリー",
                "Clannad ~After Story~",
                "Clannad ~After Story~",
                "Clannad ~After Story~",
                "Clannad ~After Story~"
            ],
            "episodes": 24,
            "genres": [
                "Drama",
                "Romance",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Clannad: After Story, the sequel to the critically acclaimed slice-of-life series Clannad, begins after Tomoya Okazaki and Nagisa Furukawa graduate from high school. Together, they experience the emotional rollercoaster of growing up. Unable to decide on a course for his future, Tomoya learns the value of a strong work ethic and discovers the strength of Nagisa's support. Through the couple's dedication and unity of purpose, they push forward to confront their personal problems, deepen their old relationships, and create new bonds.\n\nTime also moves on in the Illusionary World. As the plains grow cold with the approach of winter, the Illusionary Girl and the Garbage Doll are presented with a difficult situation that reveals the World's true purpose.\n\nBased on the visual novel by Key and produced by Kyoto Animation, Clannad: After Story is an impactful drama highlighting the importance of family and the struggles of adulthood.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "15335",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/10/51723.jpg",
            "link": "https://myanimelist.net/anime/15335/Gintama_Movie_2__Kanketsu-hen_-_Yorozuya_yo_Eien_Nare",
            "ranking": 19,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/10/51723.jpg?s=27cd24446486572fb64c42a689d38902",
            "title": "Gintama Movie 2: Kanketsu-hen - Yorozuya yo Eien Nare",
            "hasRanking": true,
            "alternativeTitles": [
                "Gintama: The Final Chapter - Be Forever Yorozuya",
                "Gintama Movie 2",
                "劇場版 銀魂 完結篇 万事屋よ永遠なれ",
                "Gintama the Movie 2"
            ],
            "episodes": 1,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "When Gintoki apprehends a movie pirate at a premiere, he checks the camera's footage and finds himself transported to a bleak, post-apocalyptic version of Edo, where a mysterious epidemic called the \"White Plague\" has ravished the world's population. It turns out that the movie pirate wasn't a pirate after all—it was an android time machine, and Gintoki has been hurtled five years into the future! Shinpachi and Kagura, his Yorozuya cohorts, have had a falling out and are now battle-hardened solo vigilantes and he himself has been missing for years, disappearing without a trace after scribbling a strange message in his journal.\n\nSetting out in the disguise given to him by the android time machine, Gintoki haphazardly reunites the Yorozuya team to investigate the White Plague, and soon discovers that the key to saving the future lies in the darkness of his own past. Determined to confront a powerful foe, he makes an important discovery—with a ragtag band of friends and allies at his side, he doesn't have to fight alone.\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "2904",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/4/9391.jpg",
            "link": "https://myanimelist.net/anime/2904/Code_Geass__Hangyaku_no_Lelouch_R2",
            "ranking": 20,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/4/9391.jpg?s=be052972605dd5422ef2df117766cff0",
            "title": "Code Geass: Hangyaku no Lelouch R2",
            "hasRanking": true,
            "alternativeTitles": [
                "Code Geass: Hangyaku no Lelouch 2nd Season",
                "Code Geass: Hangyaku no Lelouch Second Season",
                "コードギアス 反逆のルルーシュ 続編",
                "Code Geass: Lelouch of the Rebellion R2",
                "Code Geass: Lelouch of the Rebellion R2",
                "Code Geass: Lelouch",
                "el de la Rebelión R2",
                "Code Geass: Lelouch of the Rebellion R2"
            ],
            "episodes": 25,
            "genres": [
                "Action",
                "Drama",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "One year has passed since the Black Rebellion, a failed uprising against the Holy Britannian Empire led by the masked vigilante Zero, who is now missing. At a loss without their revolutionary leader, Area 11's resistance group—the Black Knights—find themselves too powerless to combat the brutality inflicted upon the Elevens by Britannia, which has increased significantly in order to crush any hope of a future revolt. \n\nLelouch Lamperouge, having lost all memory of his double life, is living peacefully alongside his friends as a high school student at Ashford Academy. His former partner C.C., unable to accept this turn of events, takes it upon herself to remind him of his past purpose, hoping that the mastermind Zero will rise once again to finish what he started, in this thrilling conclusion to the series.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "35247",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/6/87322.jpg",
            "link": "https://myanimelist.net/anime/35247/Owarimonogatari_2nd_Season",
            "ranking": 21,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/87322.jpg?s=3e60507a4b6016d83e7433aa4cb7853e",
            "title": "Owarimonogatari 2nd Season",
            "hasRanking": true,
            "alternativeTitles": [
                "End Story 2nd Season",
                "終物語",
                "Owarimonogatari Second Season",
                "Owarimonogatari Saison 2"
            ],
            "episodes": 7,
            "genres": [
                "Comedy",
                "Mystery",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Following an encounter with oddity specialist Izuko Gaen, third-year high school student Koyomi Araragi wakes up in a strange, deserted void only to be greeted by a joyfully familiar face in an alarmingly unfamiliar place.  \n\nAraragi, with the help of his girlfriend Hitagi Senjougahara, maneuvers through the webs of his past and the perplexities of the present in search of answers. However, fate once again delivers him to the eccentric transfer student Ougi Oshino, who brings forth an unexpected proposal that may unearth the very foundation to which he is anchored. As Araragi peels back the layers of mystery surrounding an apparition, he discovers a truth not meant to be revealed.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "37491",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1776/96566.jpg",
            "link": "https://myanimelist.net/anime/37491/Gintama__Shirogane_no_Tamashii-hen_-_Kouhan-sen",
            "ranking": 22,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1776/96566.jpg?s=e1aed468f049dd9444375e9149d33d65",
            "title": "Gintama.: Shirogane no Tamashii-hen - Kouhan-sen",
            "hasRanking": true,
            "alternativeTitles": [
                "Gintama.: Silver Soul Arc 2",
                "銀魂. 銀ノ魂篇 後半戦",
                "Gintama.: Silver Soul Arc - Second Half War"
            ],
            "episodes": 14,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Following the temporary retreat of the Altana Liberation Army from the Kabuki District, the state of the war has seemingly improved. However, as the Oniwaban, Shinsengumi, and residents of the district combat the army's remnants, Edo's greatest inventor Gengai Hiraga is abducted. Responsible for causing the enemy's withdrawal by rendering their weapons useless, Gengai's nanomachine virus is now at risk of being shut down.\n\nMeanwhile, a laser capable of obliterating a planet is activated in Earth's orbit on the Liberation Army's mother ship. Another battle ensues when Shinsuke Takasugi and the rest of the Kiheitai arrive on the vessel to stop the weapon from firing. Forced to fight a war on two fronts, the Yorozuya and their allies must prevail on both sides to save Edo and the rest of the world.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "47778",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1908/120036.jpg",
            "link": "https://myanimelist.net/anime/47778/Kimetsu_no_Yaiba__Yuukaku-hen",
            "ranking": 23,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1908/120036.jpg?s=34065463bac342e6efe8bfdbed5d24de",
            "title": "Kimetsu no Yaiba: Yuukaku-hen",
            "hasRanking": true,
            "alternativeTitles": [
                "鬼滅の刃 遊郭編",
                "Demon Slayer: Kimetsu no Yaiba Entertainment District Arc"
            ],
            "episodes": 11,
            "genres": [
                "Action",
                "Fantasy"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "The devastation of the Mugen Train incident still weighs heavily on the members of the Demon Slayer Corps. Despite being given time to recover, life must go on, as the wicked never sleep: a vicious demon is terrorizing the alluring women of the Yoshiwara Entertainment District. The Sound Pillar, Tengen Uzui, and his three wives are on the case. However, when he soon loses contact with his spouses, Tengen fears the worst and enlists the help of Tanjirou Kamado, Zenitsu Agatsuma, and Inosuke Hashibira to infiltrate the district's most prominent houses and locate the depraved Upper Rank demon.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "32281",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/5/87048.jpg",
            "link": "https://myanimelist.net/anime/32281/Kimi_no_Na_wa",
            "ranking": 24,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/5/87048.jpg?s=2bca128fcb9dfd6d0908f3d9986576c6",
            "title": "Kimi no Na wa.",
            "hasRanking": true,
            "alternativeTitles": [
                "君の名は。",
                "Your Name.",
                "Your Name.",
                "Your Name.",
                "Your Name."
            ],
            "episodes": 1,
            "genres": [
                "Drama",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Mitsuha Miyamizu, a high school girl, yearns to live the life of a boy in the bustling city of Tokyo—a dream that stands in stark contrast to her present life in the countryside. Meanwhile in the city, Taki Tachibana lives a busy life as a high school student while juggling his part-time job and hopes for a future in architecture.\n\nOne day, Mitsuha awakens in a room that is not her own and suddenly finds herself living the dream life in Tokyo—but in Taki's body! Elsewhere, Taki finds himself living Mitsuha's life in the humble countryside. In pursuit of an answer to this strange phenomenon, they begin to search for one another.\n\nKimi no Na wa. revolves around Mitsuha and Taki's actions, which begin to have a dramatic impact on each other's lives, weaving them into a fabric held together by fate and circumstance.\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "40028",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1000/110531.jpg",
            "link": "https://myanimelist.net/anime/40028/Shingeki_no_Kyojin__The_Final_Season",
            "ranking": 25,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1000/110531.jpg?s=3df5ebb6800604dc04c6a6187dd7161b",
            "title": "Shingeki no Kyojin: The Final Season",
            "hasRanking": true,
            "alternativeTitles": [
                "Shingeki no Kyojin Season 4",
                "Attack on Titan Season 4",
                "進撃の巨人 The Final Season",
                "Attack on Titan: The Final Season",
                "Attack on Titan Final Season",
                "Ataque a los Titanes Temporada Final",
                "L'Attaque des Titans Saison Finale"
            ],
            "episodes": 16,
            "genres": [
                "Action",
                "Drama"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Gabi Braun and Falco Grice have been training their entire lives to inherit one of the seven Titans under Marley's control and aid their nation in eradicating the Eldians on Paradis. However, just as all seems well for the two cadets, their peace is suddenly shaken by the arrival of Eren Yeager and the remaining members of the Survey Corps.\n\nHaving finally reached the Yeager family basement and learned about the dark history surrounding the Titans, the Survey Corps has at long last found the answer they so desperately fought to uncover. With the truth now in their hands, the group set out for the world beyond the walls.\n\nIn Shingeki no Kyojin: The Final Season, two utterly different worlds collide as each party pursues its own agenda in the long-awaited conclusion to Paradis' fight for freedom.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "48583",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1948/120625.jpg",
            "link": "https://myanimelist.net/anime/48583/Shingeki_no_Kyojin__The_Final_Season_Part_2",
            "ranking": 26,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1948/120625.jpg?s=53584a9c479506f8c779fb38b02d1a6d",
            "title": "Shingeki no Kyojin: The Final Season Part 2",
            "hasRanking": true,
            "alternativeTitles": [
                "Shingeki no Kyojin Season 4",
                "Attack on Titan Season 4",
                "進撃の巨人 The Final Season Part 2",
                "Attack on Titan: The Final Season Part 2"
            ],
            "episodes": 12,
            "genres": [
                "Action",
                "Drama"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Turning against his former allies and enemies alike, Eren Yeager sets a disastrous plan in motion. Under the guidance of the Beast Titan, Zeke, Eren takes extreme measures to end the ancient conflict between Marley and Eldia—but his true intentions remain a mystery. Delving deep into his family's past, Eren fights to control his own destiny.\n\nMeanwhile, the long-feuding nations of Marley and Eldia utilize both soldiers and Titans in a brutal race to eliminate the other. Reiner Braun uses his own powers in a desperate bid to hold off Eren's own militaristic force, and his fellow Eldians—children Falco Grice and Gabi Braun—struggle to survive in the unfolding chaos.\n\nElsewhere, Eren's childhood friends Mikasa Ackerman and Armin Arlert remain imprisoned alongside Eren's former Survey Corps companions, all disturbed by Eren's monstrous transformation. Under the blind belief that Eren still secretly harbors good intentions, Mikasa and the others enter the fray in an attempt to save their friend's very soul.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "19",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/10/18793.jpg",
            "link": "https://myanimelist.net/anime/19/Monster",
            "ranking": 27,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/10/18793.jpg?s=08c4f10a101c3835eeb14ca0715512bd",
            "title": "Monster",
            "hasRanking": true,
            "alternativeTitles": [
                "モンスター",
                "Monster"
            ],
            "episodes": 74,
            "genres": [
                "Drama",
                "Mystery",
                "Suspense"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Dr. Kenzou Tenma, an elite neurosurgeon recently engaged to his hospital director's daughter, is well on his way to ascending the hospital hierarchy. That is until one night, a seemingly small event changes Dr. Tenma's life forever. While preparing to perform surgery on someone, he gets a call from the hospital director telling him to switch patients and instead perform life-saving brain surgery on a famous performer. His fellow doctors, fiancée, and the hospital director applaud his accomplishment; but because of the switch, a poor immigrant worker is dead, causing Dr. Tenma to have a crisis of conscience.\n\nSo when a similar situation arises, Dr. Tenma stands his ground and chooses to perform surgery on the young boy Johan Liebert instead of the town's mayor. Unfortunately, this choice leads to serious ramifications for Dr. Tenma—losing his social standing being one of them. However, with the mysterious death of the director and two other doctors, Dr. Tenma's position is restored. With no evidence to convict him, he is released and goes on to attain the position of hospital director. \n\nNine years later when Dr. Tenma saves the life of a criminal, his past comes back to haunt him—once again, he comes face to face with the monster he operated on. He must now embark on a quest of pursuit to make amends for the havoc spread by the one he saved.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "50160",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1566/122794.jpg",
            "link": "https://myanimelist.net/anime/50160/Kingdom_4th_Season",
            "ranking": 28,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1566/122794.jpg?s=1dd290c4b0bc3df1083c456064109e2f",
            "title": "Kingdom 4th Season",
            "hasRanking": true,
            "alternativeTitles": [
                "キングダム 第4シリーズ",
                "Kingdom Season 4"
            ],
            "episodes": 26,
            "genres": [],
            "hasEpisode": true,
            "status": "Currently Airing",
            "synopsis": "Following the conclusion of the large-scale coalition campaign, the entirety of China is in a state of economic recovery. The victor of the battle, the state of Qin, is no different. There, the political parties led by Ying Zheng and Buwei Lü continue their inner conflict. Having played the role of king in the coalition battle, Zheng has the trust of the people—but Lü is far from out of the fight. In 18 months, he plans to interrupt Zheng's coming-of-age ceremony.\n\nMeanwhile, a Zhao army numbering 20,000 troops has set out toward Qin. In the royal court, due to the lack of generals capable of responding to the incoming threat, Lü slyly suggests that Zheng take command. However, Cheng Jiao, Zheng's half-brother, volunteers instead. As they grew to trust each other during the coalition battle, Zheng now accepts Jiao as his replacement.\n\nHowever, the Zhao forces retreat a mere half-day after clashing with Jiao's army. With trouble quickly brewing in the shadows, the internal struggle of Qin is only complicated further. There are only two men Zheng feels he can rely on: Bi, a general who commands 30,000 men; and Xin, the leader of the Fei Xin force.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "36838",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/12/89603.jpg",
            "link": "https://myanimelist.net/anime/36838/Gintama__Shirogane_no_Tamashii-hen",
            "ranking": 29,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/12/89603.jpg?s=635cb89402d5d39f43767f3942e91206",
            "title": "Gintama.: Shirogane no Tamashii-hen",
            "hasRanking": true,
            "alternativeTitles": [
                "銀魂. 銀ノ魂篇",
                "Gintama.: Silver Soul Arc"
            ],
            "episodes": 12,
            "genres": [
                "Action",
                "Comedy",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "After the fierce battle on Rakuyou, the untold past and true goal of the immortal Naraku leader, Utsuro, are finally revealed. By corrupting the Altana reserves of several planets, Utsuro has successfully triggered the intervention of the Tendoshuu’s greatest enemy: the Altana Liberation Army. With Earth as the main battleground in this interplanetary war, Utsuro's master plan to destroy the planet—and himself—is nearly complete. \n\nAn attack on the O-Edo Central Terminal marks the beginning of the final battle to take back the land of the samurai. With the Yorozuya nowhere in sight, the bakufu all but collapsed, and the Shogun missing, the people are left completely helpless as the Liberation Army begins pillaging Edo in the name of freeing them from the Tendoshuu's rule. \n\nCaught in the crossfire between two equally imposing forces, can Gintoki, Kagura, Shinpachi, and the former students of Shouyou Yoshida put aside their differences and unite their allies to protect what they hold dear?\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "40682",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1443/111830.jpg",
            "link": "https://myanimelist.net/anime/40682/Kingdom_3rd_Season",
            "ranking": 30,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1443/111830.jpg?s=a67f547ff56d05b36123d793df962b45",
            "title": "Kingdom 3rd Season",
            "hasRanking": true,
            "alternativeTitles": [
                "キングダム 第3シリーズ",
                "Kingdom: Season 3"
            ],
            "episodes": 26,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Following the successful Sanyou campaign, the Qin army, including 1,000-Man Commander Xin, inches ever closer to fulfilling King Ying Zheng's dream of unifying China. With a major geographical foothold in the state of Wei now under its control, Qin sets its sights eastward toward the remaining warring states.\n\nMeanwhile Li Mu—an unparalleled strategist and the newly appointed prime minister of the state of Zhao—has taken advantage of Zhao's temporary truce with Qin to negotiate with the other states without interruption. Seemingly without warning, Ying Zheng receives news that armies from the states of Chu, Zhao, Wei, Han, Yan, and Qi have crossed into Qin territory. Realizing too late the purpose behind Li Mu's truce with Qin, Zheng quickly gathers his advisors to devise a plan to address the six-state coalition army on their doorstep. For the first time in history, the state of Qin faces complete destruction and must use every resource and strategy at their disposal to prevent themselves from being wiped off the map.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "37510",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1918/96303.jpg",
            "link": "https://myanimelist.net/anime/37510/Mob_Psycho_100_II",
            "ranking": 31,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1918/96303.jpg?s=b5b51cff7ba201e4f1acf37f4f44e224",
            "title": "Mob Psycho 100 II",
            "hasRanking": true,
            "alternativeTitles": [
                "Mob Psycho 100 2nd Season",
                "Mob Psycho Hyaku",
                "Mob Psycho One Hundred",
                "モブサイコ100 II",
                "Mob Psycho 100 II"
            ],
            "episodes": 13,
            "genres": [
                "Action",
                "Comedy",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Shigeo \"Mob\" Kageyama is now maturing and understanding his role as a supernatural psychic that has the power to drastically affect the livelihood of others. He and his mentor Reigen Arataka continue to deal with supernatural requests from clients, whether it be exorcizing evil spirits or tackling urban legends that haunt the citizens.\n\nWhile the workflow remains the same, Mob isn't just blindly following Reigen around anymore. With all his experiences as a ridiculously strong psychic, Mob's supernatural adventures now have more weight to them. Things take on a serious and darker tone as the dangers Mob and Reigen face are much more tangible and unsettling than ever before.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "31758",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1084/112813.jpg",
            "link": "https://myanimelist.net/anime/31758/Kizumonogatari_III__Reiketsu-hen",
            "ranking": 32,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1084/112813.jpg?s=db4fcf9c5e229584ca1b04bcebe2c3dc",
            "title": "Kizumonogatari III: Reiketsu-hen",
            "hasRanking": true,
            "alternativeTitles": [
                "Koyomi Vamp",
                "傷物語〈Ⅲ冷血篇〉",
                "Kizumonogatari Part 3: Cold-Blooded",
                "Kizumonogatari III: Reiketsuhen",
                "Kizumonogatari Partie 3: Sang Glacial"
            ],
            "episodes": 1,
            "genres": [
                "Action",
                "Mystery",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "After helping revive the legendary vampire Kiss-shot Acerola-orion Heart-under-blade, Koyomi Araragi has become a vampire himself and her servant. Kiss-shot is certain she can turn him back into a human, but only once regaining her full power. \n\nAraragi has hunted down the three vampire hunters that defeated Kiss-shot and retrieved her limbs to return her to full strength. However, now that Araragi has almost accomplished what he’s been fighting for this whole time, he has to consider if this is what he really wants. Once he revives this powerful immortal vampire, there is no telling what she might do, and there would be no way of stopping her.\n\nBut there is more to the story that Araragi doesn’t understand. If a newborn vampire like him could defeat the hunters, how did they overpower Kiss-shot? Can he trust her to turn him back to a human? And how is that even possible in the first place?\n\nAraragi is at his limit but he must come to a decision, and it may not be possible to resolve this situation without doing something he’ll regret…\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "32935",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/7/81992.jpg",
            "link": "https://myanimelist.net/anime/32935/Haikyuu__Karasuno_Koukou_vs_Shiratorizawa_Gakuen_Koukou",
            "ranking": 33,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/7/81992.jpg?s=6d977383e0b5dc1ba1c122213178e547",
            "title": "Haikyuu!!: Karasuno Koukou vs. Shiratorizawa Gakuen Koukou",
            "hasRanking": true,
            "alternativeTitles": [
                "Haikyuu!! Third Season",
                "Haikyuu!! Karasuno High VS Shiratorizawa Academy",
                "ハイキュー!! 烏野高校 VS 白鳥沢学園高校",
                "Haikyu!! 3rd Season",
                "Haikyuu!!Staffel 3 Karasuno vs. Shiratorizawa",
                "Haikyu!! Los Ases del Vóley Temporada 3",
                "Haikyuu!! Saison 3"
            ],
            "episodes": 10,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "After the victory against Aoba Jousai High, Karasuno High School, once called “a fallen powerhouse, a crow that can’t fly,” has finally reached the climax of the heated Spring tournament. Now, to advance to nationals, the Karasuno team has to defeat the powerhouse Shiratorizawa Academy. Karasuno’s greatest hurdle is their adversary’s ace, Wakatoshi Ushijima, the number one player in the Miyagi Prefecture, and one of the country’s top three aces.\n\nOnly the strongest team will make it to the national tournament. Since this match is the third-year players’ last chance to qualify for nationals, Karasuno has to use everything they learned during the training camp and prior matches to attain victory. Filled with restlessness and excitement, both teams are determined to come out on top in the third season of Haikyuu!!.\n\n[Written by MAL Rewrite] ",
            "type": "TV"
        },
        {
            "_id": "44074",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1135/114867.jpg",
            "link": "https://myanimelist.net/anime/44074/Shiguang_Dailiren",
            "ranking": 34,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1135/114867.jpg?s=048f06f7edb150d017394574a108c72c",
            "title": "Shiguang Dailiren",
            "hasRanking": true,
            "alternativeTitles": [
                "Shi Guang Dai Li Ren",
                "时光代理人",
                "Link Click"
            ],
            "episodes": 11,
            "genres": [
                "Drama",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "It is said that a picture is worth a thousand words. In this case, it holds an infinite amount of secrets. These are secrets that only Cheng Xiaoshi and Lu Guang are able to find. In a small shop called \"Time Photo Studio,\" the two friends provide a special service: using their extraordinary powers that let them enter photographs, they jump into pictures brought to them by clients in order to grant their wishes. Through the eyes of the photographer, they live through the events surrounding the picture and try to decipher how to solve their client's request.\n\nBut every time they jump into a picture, they take a great risk. One wrong move and they could alter the future of the person who took the picture... and possibly countless other events too. So when the events they are forced to live through in these pictures start to become personal, it will take the utmost strength to push their feelings aside and focus on accomplishing the task they were paid to do.\n\n[Written by MAL Rewrite]",
            "type": "ONA"
        },
        {
            "_id": "17074",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1807/121534.jpg",
            "link": "https://myanimelist.net/anime/17074/Monogatari_Series__Second_Season",
            "ranking": 35,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1807/121534.jpg?s=2f42455822fc348ba1fd6c50e94fcce1",
            "title": "Monogatari Series: Second Season",
            "hasRanking": true,
            "alternativeTitles": [
                "Nekomonogatari: Shiro",
                "Kabukimonogatari: Mayoi Jianshi",
                "Otorimonogatari",
                "Onimonogatari",
                "Koimonogatari",
                "〈物語〉シリーズ セカンドシーズン",
                "Monogatari Series: Second Season",
                "Monogatari Seconde Saison"
            ],
            "episodes": 26,
            "genres": [
                "Comedy",
                "Mystery",
                "Romance",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Apparitions, oddities, and gods continue to manifest around Koyomi Araragi and his close-knit group of friends: Tsubasa Hanekawa, the group's modest genius; Shinobu Oshino, the resident doughnut-loving vampire; athletic deviant Suruga Kanbaru; bite-happy spirit Mayoi Hachikuji; Koyomi's cutesy stalker Nadeko Sengoku; and Hitagi Senjogahara, the poignant tsundere.\n\nMonogatari Series: Second Season revolves around these individuals and their struggle to overcome the darkness that is rapidly approaching. A new semester has begun and with graduation looming over Araragi, he must quickly decide the paths he will walk, as well as the relationships and friends that he'll save. But as strange events begin to unfold, Araragi is nowhere to be found, and a vicious tiger apparition has appeared in his absence. Hanekawa has become its target, and she must fend for herself—or bow to the creature's perspective on the feebleness of humanity.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "199",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/6/79597.jpg",
            "link": "https://myanimelist.net/anime/199/Sen_to_Chihiro_no_Kamikakushi",
            "ranking": 36,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/79597.jpg?s=1f170071bc9a54ce2ba3c0d8c7aa6927",
            "title": "Sen to Chihiro no Kamikakushi",
            "hasRanking": true,
            "alternativeTitles": [
                "Sen and Chihiro's Spiriting Away",
                "千と千尋の神隠し",
                "Spirited Away",
                "Chihiros Reise ins Zauberland",
                "El viaje de Chihiro",
                "Le Voyage de Chihiro"
            ],
            "episodes": 1,
            "genres": [
                "Adventure",
                "Award Winning",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Stubborn, spoiled, and naïve, 10-year-old Chihiro Ogino is less than pleased when she and her parents discover an abandoned amusement park on the way to their new house. Cautiously venturing inside, she realizes that there is more to this place than meets the eye, as strange things begin to happen once dusk falls. Ghostly apparitions and food that turns her parents into pigs are just the start—Chihiro has unwittingly crossed over into the spirit world. Now trapped, she must summon the courage to live and work amongst spirits, with the help of the enigmatic Haku and the cast of unique characters she meets along the way.\n\nVivid and intriguing, Sen to Chihiro no Kamikakushi tells the story of Chihiro's journey through an unfamiliar world as she strives to save her parents and return home.\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "1",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/4/19644.jpg",
            "link": "https://myanimelist.net/anime/1/Cowboy_Bebop",
            "ranking": 37,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/4/19644.jpg?s=bb1e96eb0a0224a57aa45443eab92575",
            "title": "Cowboy Bebop",
            "hasRanking": true,
            "alternativeTitles": [
                "カウボーイビバップ",
                "Cowboy Bebop"
            ],
            "episodes": 26,
            "genres": [
                "Action",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Crime is timeless. By the year 2071, humanity has expanded across the galaxy, filling the surface of other planets with settlements like those on Earth. These new societies are plagued by murder, drug use, and theft, and intergalactic outlaws are hunted by a growing number of tough bounty hunters.\n\nSpike Spiegel and Jet Black pursue criminals throughout space to make a humble living. Beneath his goofy and aloof demeanor, Spike is haunted by the weight of his violent past. Meanwhile, Jet manages his own troubled memories while taking care of Spike and the Bebop, their ship. The duo is joined by the beautiful con artist Faye Valentine, odd child Edward Wong Hau Pepelu Tivrusky IV, and Ein, a bioengineered Welsh Corgi.\n\nWhile developing bonds and working to catch a colorful cast of criminals, the Bebop crew's lives are disrupted by a menace from Spike's past. As a rival's maniacal plot continues to unravel, Spike must choose between life with his newfound family or revenge for his old wounds.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "33095",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/10/82947.jpg",
            "link": "https://myanimelist.net/anime/33095/Shouwa_Genroku_Rakugo_Shinjuu__Sukeroku_Futatabi-hen",
            "ranking": 38,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/10/82947.jpg?s=9f1dd28adde3fea5a733d1cfd7be7ad6",
            "title": "Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen",
            "hasRanking": true,
            "alternativeTitles": [
                "Shouwa Genroku Rakugo Shinjuu 2nd Season",
                "Showa and Genroku Era Lover's Suicide Through Rakugo 2nd Season",
                "昭和元禄落語心中～助六再び篇～",
                "Descending Stories: Showa Genroku Rakugo Shinju",
                "Le Rakugo ou la Vie 2"
            ],
            "episodes": 12,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Even after having risen to the utmost rank of shun'ichi, Yotarou struggles to find his own identity in the world of rakugo. Caught between his master's teachings and the late Sukeroku's unique style, his performance lacks an important ingredient—ego. And while his popularity packs the theaters, he is but one of the few; rakugo is under threat of being eclipsed.\n\nMeanwhile Yakumo, regarded by many as the last bastion of preserving the popularity of rakugo, struggles to cope with his elderly state. Even though his performances are still stellar, he fears that he is nearing his limits. His doubts grow stronger as an old friend creeps ever closer. Konatsu, for her part, attempts to raise her son as a single mother, which Yotarou is heavily opposed to. Instead, he seeks to persuade her to marry him and in turn raise her son as his own.\n\nIn Shouwa Genroku Rakugo Shinjuu: Sukeroku Futatabi-hen, the curtains fall on Yotarou and Yakumo's story, tasked with restoring the near-obsolete art form as well as overcoming their internal conflicts.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "24701",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/9/68095.jpg",
            "link": "https://myanimelist.net/anime/24701/Mushishi_Zoku_Shou_2nd_Season",
            "ranking": 39,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/9/68095.jpg?s=6025adedafce15a9d2c9363e225241ba",
            "title": "Mushishi Zoku Shou 2nd Season",
            "hasRanking": true,
            "alternativeTitles": [
                "Mushishi Zoku Shou 2nd Season",
                "蟲師 続章",
                "Mushi-shi: Next Passage Part 2"
            ],
            "episodes": 10,
            "genres": [
                "Adventure",
                "Fantasy",
                "Mystery",
                "Slice of Life",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Ghostly, primordial beings known as Mushi continue to cause mysterious changes in the lives of humans. The travelling Mushishi, Ginko, persists in trying to set right the strange and unsettling situations he encounters. Time loops, living shadows, and telepathy are among the overt effects of interference from Mushi, but more subtle symptoms that take years to be noticed also rouse Ginko's concern as he passes from village to village.\n\nThrough circumstance, Ginko has become an arbiter, determining which Mushi are blessings and which are curses. But the lines that he seeks to draw are subjective. Some of his patients would rather exercise their new powers until they are utterly consumed by them; others desperately strive to rid themselves of afflictions which are in fact protecting their lives from devastation. Those who cross paths with Mushi must learn to accept seemingly impossible consequences for their actions, and heal wounds they did not know they had. Otherwise, they risk meeting with fates beyond their comprehension.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "45576",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1028/117777.jpg",
            "link": "https://myanimelist.net/anime/45576/Mushoku_Tensei__Isekai_Ittara_Honki_Dasu_Part_2",
            "ranking": 40,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1028/117777.jpg?s=99ecca20cac2345fc956fda60a5e025f",
            "title": "Mushoku Tensei: Isekai Ittara Honki Dasu Part 2",
            "hasRanking": true,
            "alternativeTitles": [
                "無職転生 ～異世界行ったら本気だす～ 第2クール",
                "Mushoku Tensei: Jobless Reincarnation Part 2"
            ],
            "episodes": 12,
            "genres": [
                "Drama",
                "Fantasy",
                "Ecchi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "After the mysterious mana calamity, Rudeus Greyrat and his fierce student Eris Boreas Greyrat are teleported to the Demon Continent. There, they team up with their newfound companion Ruijerd Supardia—the former leader of the Superd's Warrior group—to form \"Dead End,\" a successful adventurer party. Making a name for themselves, the trio journeys across the continent to make their way back home to Fittoa.\n\nFollowing the advice he received from the faceless god Hitogami, Rudeus saves Kishirika Kishirisu, the Great Emperor of the Demon World, who rewards him by granting him a strange power. Now, as Rudeus masters the powerful ability that offers a number of new opportunities, it might prove to be more than what he bargained for when unexpected dangers threaten to hinder their travels.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "46102",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1981/113348.jpg",
            "link": "https://myanimelist.net/anime/46102/Odd_Taxi",
            "ranking": 41,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1981/113348.jpg?s=38082dbb5a64de5fc2129a59c46c3fe0",
            "title": "Odd Taxi",
            "hasRanking": true,
            "alternativeTitles": [
                "オッドタクシー",
                "Odd Taxi"
            ],
            "episodes": 13,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Eccentric and blunt, the walrus Hiroshi Odokawa lives a relatively normal life. He drives a taxi for a living, and there he meets several unique individuals: the jobless Taichi Kabasawa who is dead-set on going viral, the mysterious nurse Miho Shirakawa, the struggling comedic duo \"Homo Sapiens,\" and Dobu, a well-known delinquent.\n\nBut Odokawa's simple way of life is about to be turned upside-down. The case of a missing girl the police have been tracking leads back to him, and now both the yakuza and a duo of corrupt cops are on his tail. Set in a strangely familiar city filled with unusual individuals, Odd Taxi is a bizarre story about a humble taxi driver and the mystery of a lost high schooler.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "263",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/4/86334.jpg",
            "link": "https://myanimelist.net/anime/263/Hajime_no_Ippo",
            "ranking": 42,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/4/86334.jpg?s=4b3096d30158e251d87c196e56c04e63",
            "title": "Hajime no Ippo",
            "hasRanking": true,
            "alternativeTitles": [
                "The First Step",
                "Hajime no Ippo: The Fighting",
                "はじめの一歩 THE FIGHTING!",
                "Fighting Spirit",
                "Hajime no Ippo: Espíritu de Lucha",
                "IPPO Le Challenger"
            ],
            "episodes": 75,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "In his father's absence, teenager Ippo Makunouchi works hard to help his mother run her fishing boat rental business. Ippo's timid nature, his lack of sleep, and the sea smell make him an easy target for relentless bullies who leave him bruised and beaten on a daily basis. Mamoru Takamura, an up-and-coming boxer, rescues Ippo from a violent after-school incident and takes him back to the Kamogawa Boxing Gym for recovery. Takamura and his fellow boxers, Masaru Aoki and Tatsuya Kimura, are stunned by Ippo's powerful punches—a result of strong muscles developed through years serving his physically taxing family business. \n\nFollowing brief training under Takamura, Ippo impresses the other boxers in a practice match against prodigy Ichirou Miyata. He gains a rival in Miyata and a coach in Genji Kamogawa, the gym owner and a former boxer himself. As Ippo takes the first steps in his official boxing career, he faces off against a series of challenging opponents, each more powerful than the last. Victory, loss, and a cycle of dedicated training await Ippo on his journey to achieve greatness. With his tough body and unstoppable fighting spirit, the kind young man seeks to take on the world.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "37521",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1500/103005.jpg",
            "link": "https://myanimelist.net/anime/37521/Vinland_Saga",
            "ranking": 43,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1500/103005.jpg?s=b21dbd168612f531ce4eec9bd53e272b",
            "title": "Vinland Saga",
            "hasRanking": true,
            "alternativeTitles": [
                "ヴィンランド・サガ"
            ],
            "episodes": 24,
            "genres": [
                "Action",
                "Adventure",
                "Drama"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Young Thorfinn grew up listening to the stories of old sailors that had traveled the ocean and reached the place of legend, Vinland. It's said to be warm and fertile, a place where there would be no need for fighting—not at all like the frozen village in Iceland where he was born, and certainly not like his current life as a mercenary. War is his home now. Though his father once told him, \"You have no enemies, nobody does. There is nobody who it's okay to hurt,\" as he grew, Thorfinn knew that nothing was further from the truth.\n\nThe war between England and the Danes grows worse with each passing year. Death has become commonplace, and the viking mercenaries are loving every moment of it. Allying with either side will cause a massive swing in the balance of power, and the vikings are happy to make names for themselves and take any spoils they earn along the way. Among the chaos, Thorfinn must take his revenge and kill Askeladd, the man who murdered his father. The only paradise for the vikings, it seems, is the era of war and death that rages on.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "21939",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/13/58533.jpg",
            "link": "https://myanimelist.net/anime/21939/Mushishi_Zoku_Shou",
            "ranking": 44,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/13/58533.jpg?s=ff40f900ea0877725ccde517b126c531",
            "title": "Mushishi Zoku Shou",
            "hasRanking": true,
            "alternativeTitles": [
                "Mushi-shi Zoku Shou",
                "Mushishi: The Next Chapter",
                "蟲師 続章",
                "Mushi-shi: Next Passage Part 1",
                "Mushi-Shi -The Next Passage-",
                "Mushi-Shi -The Next Passage-",
                "Mushishi Zoku Shô"
            ],
            "episodes": 10,
            "genres": [
                "Adventure",
                "Fantasy",
                "Mystery",
                "Slice of Life",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Perceived as strange and feared by man, over time the misshapen ones came to be known as Mushi. Although they harbor no ill intentions towards humans, many suffer from the side effects of their existence and strange nature; exploiting the Mushi without understanding them, even unintentionally, can lead to disaster and strife for any involved. Mushishi Zoku Shou continues the story of Mushishi Ginko on his journey to help the visible world to coexist with the Mushi.\n\nDuring his travels, Ginko discovers various gifted individuals—those cursed by circumstance and those maintaining a fragile symbiosis with the Mushi—inevitably confronting the question of whether humanity, talented and tortured alike, can manage the responsibility of the unseen. Moreover, as a Mushishi, Ginko must learn more about these strange beings and decide if he has the right to interfere with the complex relationships between Mushi and mankind.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "44",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1391/120839.jpg",
            "link": "https://myanimelist.net/anime/44/Rurouni_Kenshin__Meiji_Kenkaku_Romantan_-_Tsuioku-hen",
            "ranking": 45,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1391/120839.jpg?s=3168ae8383de7eb65ccb8b1d3a775c22",
            "title": "Rurouni Kenshin: Meiji Kenkaku Romantan - Tsuioku-hen",
            "hasRanking": true,
            "alternativeTitles": [
                "Rurouni Kenshin: Tsuiokuhen",
                "Rurouni Kenshin: Reminiscence",
                "るろうに剣心―明治剣客浪漫譚―追憶編",
                "Samurai X: Trust and Betrayal",
                "Rurouni Kenshin Trust and Betrayal",
                "Kenshin: El Guerrero Samurai  \"Recuerdos\"",
                "Kenshin Le Vagabond: Le Chapitre de la Mémoire"
            ],
            "episodes": 4,
            "genres": [
                "Action",
                "Drama",
                "Romance"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "When mankind's savagery surpasses his fear of death, there is little hope for those who wish to live honest lives. Beneath a full moon, a young boy witnesses the murder of the bandits who had enslaved him, and is then christened with a new name by the man who rescued him. This boy is Shinta, now known as Kenshin Himura, and he is destined to become a swordsman. The softness of his heart does not befit the occupation, but his desire to protect the innocent is absolute.\n\nRurouni Kenshin: Meiji Kenkaku Romantan - Tsuioku-hen details the origins of the man who would bear the name of Hitokiri Battousai long before he swore his oath not to kill and before he earned his reputation as an assassin. The young man's heart is divided between justice and corruption, while the fate of a nation rests on his actions.\n\n[Written by MAL Rewrite]",
            "type": "OVA"
        },
        {
            "_id": "48569",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1321/117508.jpg",
            "link": "https://myanimelist.net/anime/48569/86_Part_2",
            "ranking": 46,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1321/117508.jpg?s=c65bc9967a249eb362a1e037e13ebd73",
            "title": "86 Part 2",
            "hasRanking": true,
            "alternativeTitles": [
                "86―エイティシックス―",
                "86 Eighty-Six Part 2"
            ],
            "episodes": 12,
            "genres": [
                "Action",
                "Drama",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "The disappearance of the Spearhead Squadron beyond the horizon does little to hide the intensity of the Republic of San Magnolia's endless propaganda. Vladilena Milizé continues to operate as \"Handler One,\" the commander of yet another dehumanized 86th faction's squadron in the continuous war against the Legion.\n\nOn the Western Front, Shinei Nouzen and his squad are quarantined in a military base controlled by the Federal Republic of Giad, formerly known as the Giadian Empire. The newly-established government grants the saved Eighty-Six full citizenship and freedom. Housed by the president Ernst Zimmerman himself, the group meets his adoptive daughter and the last Empress, Augusta Frederica Adel-Adler.\n\nHowever, within the calm of this tender society, Shinei and his team feel that their purpose is on the battlefield. Before long, they are once again in the midst of the Legion's onslaught as a part of the Federacy's Nordlicht Squadron, accompanied by Augusta Frederica. But, as history repeats itself, they realize that no matter the side, death and pain on the front lines are the only comfort they know.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "2921",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/3/45028.jpg",
            "link": "https://myanimelist.net/anime/2921/Ashita_no_Joe_2",
            "ranking": 47,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/3/45028.jpg?s=bf58ff0c0759f78bf968a74ec535d0d2",
            "title": "Ashita no Joe 2",
            "hasRanking": true,
            "alternativeTitles": [
                "Rocky Joe 2",
                "あしたのジョー２",
                "Tomorrow's Joe 2",
                "N/A",
                "El Campeón/ El mañana de Joe 2"
            ],
            "episodes": 47,
            "genres": [
                "Action",
                "Drama",
                "Slice of Life",
                "Sports"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Yabuki Joe is left downhearted and hopeless after a certain tragic event. In attempt to put the past behind him, Joe leaves the gym behind and begins wandering. On his travels he comes across the likes of Wolf Kanagushi and Goromaki Gondo, men who unintentionally fan the dying embers inside him, leading him to putting his wanderings to an end. His return home puts Joe back on the path to boxing, but unknown to himself and his trainer, he now suffers deep-set issues holding him back from fighting. In attempt to quell those issues, Carlos Rivera, a world renowned boxer is invited from Venezuela to help Joe recover.",
            "type": "TV"
        },
        {
            "_id": "33050",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1142/112957.jpg",
            "link": "https://myanimelist.net/anime/33050/Fate_stay_night_Movie__Heavens_Feel_-_III_Spring_Song",
            "ranking": 48,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1142/112957.jpg?s=f0984cb6fcb8188ce26035b0b56de828",
            "title": "Fate/stay night Movie: Heaven's Feel - III. Spring Song",
            "hasRanking": true,
            "alternativeTitles": [
                "Fate/stay night Movie: Heaven's Feel 3",
                "劇場版「Fate/stay night [Heaven's Feel] III.spring song」",
                "Fate/stay night: Heaven's Feel - III. Spring Song",
                "Fate/stay night: Heaven's Feel - III. Spring Song"
            ],
            "episodes": 1,
            "genres": [
                "Action",
                "Fantasy",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "The Fifth Holy Grail War in Fuyuki City has reached a turning point in which the lives of all participants are threatened as the hidden enemy finally reveals itself. As Shirou Emiya, Rin Toosaka, and Illyasviel von Einzbern discover the true, corruptive nature of the shadow that has been rampaging throughout the city, they realize just how dire the situation is. In order to protect their beloved ones, the group must hold their own against the seemingly insurmountable enemy force—even if some of those foes were once their allies, or perhaps, something more intimate.\n\nAs the final act of this chaotic war commences, the ideals Shirou believes will soon be challenged by an excruciating dilemma: is it really possible to save a world where everything seems to have gone wrong?\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "1575",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/5/50331.jpg",
            "link": "https://myanimelist.net/anime/1575/Code_Geass__Hangyaku_no_Lelouch",
            "ranking": 49,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/5/50331.jpg?s=afd09d7e5d76283418a1a22e7c122ca9",
            "title": "Code Geass: Hangyaku no Lelouch",
            "hasRanking": true,
            "alternativeTitles": [
                "コードギアス 反逆のルルーシュ",
                "Code Geass: Lelouch of the Rebellion",
                "Code Geass: Lelouch of the Rebellion",
                "Code Geass: Lelouch",
                "el de la Rebelión",
                "Code Geass: Lelouch of the Rebellion"
            ],
            "episodes": 25,
            "genres": [
                "Action",
                "Drama",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "In the year 2010, the Holy Empire of Britannia is establishing itself as a dominant military nation, starting with the conquest of Japan. Renamed to Area 11 after its swift defeat, Japan has seen significant resistance against these tyrants in an attempt to regain independence.\n\nLelouch Lamperouge, a Britannian student, unfortunately finds himself caught in a crossfire between the Britannian and the Area 11 rebel armed forces. He is able to escape, however, thanks to the timely appearance of a mysterious girl named C.C., who bestows upon him Geass, the \"Power of Kings.\" Realizing the vast potential of his newfound \"power of absolute obedience,\" Lelouch embarks upon a perilous journey as the masked vigilante known as Zero, leading a merciless onslaught against Britannia in order to get revenge once and for all.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "245",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/13/11460.jpg",
            "link": "https://myanimelist.net/anime/245/Great_Teacher_Onizuka",
            "ranking": 50,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/13/11460.jpg?s=7e890b7e93b7b57c2de4aa90211931bd",
            "title": "Great Teacher Onizuka",
            "hasRanking": true,
            "alternativeTitles": [
                "GTO",
                "グレート・ティーチャー・オニヅカ",
                "Great Teacher Onizuka"
            ],
            "episodes": 43,
            "genres": [
                "Comedy",
                "Drama"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Twenty-two-year-old Eikichi Onizuka—ex-biker gang leader, conqueror of Shonan, and virgin—has a dream: to become the greatest high school teacher in all of Japan. This isn't because of a passion for teaching, but because he wants a loving teenage wife when he's old and gray. Still, for a perverted, greedy, and lazy delinquent, there is more to Onizuka than meets the eye. So when he lands a job as the homeroom teacher of the Class 3-4 at the prestigious Holy Forest Academy—despite suplexing the Vice Principal—all of his talents are put to the test, as this class is particularly infamous.\n\nDue to their utter contempt for all teachers, the class' students use psychological warfare to mentally break any new homeroom teacher they get, forcing them to quit and leave school. However, Onizuka isn't your average teacher, and he's ready for any challenge in his way.\n\nBullying, suicide, and sexual harassment are just a few of the issues his students face daily. By tackling the roots of their problems, Onizuka supports them with his unpredictable and unconventional methods—even if it means jumping off a building to save a suicidal child. Thanks to his eccentric charm and fun-loving nature, Class 3-4 slowly learns just how enjoyable school can be when you're the pupils of the Great Teacher Onizuka.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "40434",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1634/116782.jpg",
            "link": "https://myanimelist.net/anime/40434/Mo_Dao_Zu_Shi__Wanjie_Pian",
            "ranking": 51,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1634/116782.jpg?s=f3e813705fd0d84678835c9f3d36f3dd",
            "title": "Mo Dao Zu Shi: Wanjie Pian",
            "hasRanking": true,
            "alternativeTitles": [
                "Grandmaster of Demonic Cultivation 3",
                "The Founder of Diabolism 3",
                "Mo Dao Zu Shi 3rd Season",
                "Mo Dao Zu Shi Final Arc",
                "魔道祖师 完结篇",
                "The Founder of Diabolism Season 3"
            ],
            "episodes": 12,
            "genres": [
                "Action",
                "Drama",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Along an empty road in the rural countryside, Wei Wuxian and Lan Wangji stumble across a stone plaque that reads \"Yi City.\" Still on their quest to unravel the mystery behind the cursed severed arm, they venture into the deserted city to obtain further leads.\n\nHowever, with the appearance of a mysterious new cultivator, the demonic arm investigation leads Wei Wuxian and Lan Wangji to a plot that threatens the cultivation world as they know it. The gravity of the new situation escalates when the two find it involves the chief cultivator of the renowned Lanling Jin Sect—Jin Guangyao.\n\nAs the pair continue to piece together the crucial conspiracies of the cultivation history, their friends and colleagues grow suspicious of their motives. With the world against him, Wei Wuxian must prove he is not the demonic sorcerer people believe him to be to regain their trust and save the cultivation world from the sinister evil lurking within it.\n\n[Written by MAL Rewrite]\n",
            "type": "ONA"
        },
        {
            "_id": "164",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/7/75919.jpg",
            "link": "https://myanimelist.net/anime/164/Mononoke_Hime",
            "ranking": 52,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/7/75919.jpg?s=0d877ed9aa60cc49fdb128a2f68386e2",
            "title": "Mononoke Hime",
            "hasRanking": true,
            "alternativeTitles": [
                "Mononoke Hime",
                "もののけ姫",
                "Princess Mononoke",
                "Prinzessin Mononoke",
                "La Princesa Mononoke",
                "Princesse Mononoké"
            ],
            "episodes": 1,
            "genres": [
                "Action",
                "Adventure",
                "Fantasy"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "When an Emishi village is attacked by a fierce demon boar, the young prince Ashitaka puts his life at stake to defend his tribe. With its dying breath, the beast curses the prince's arm, granting him demonic powers while gradually siphoning his life away. Instructed by the village elders to travel westward for a cure, Ashitaka arrives at Tatara, the Iron Town, where he finds himself embroiled in a fierce conflict: Lady Eboshi of Tatara, promoting constant deforestation, stands against Princess San and the sacred spirits of the forest, who are furious at the destruction brought by the humans. As the opposing forces of nature and mankind begin to clash in a desperate struggle for survival, Ashitaka attempts to seek harmony between the two, all the while battling the latent demon inside of him. Princess Mononoke is a tale depicting the connection of technology and nature, while showing the path to harmony that could be achieved by mutual acceptance.\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "40748",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1171/109222.jpg",
            "link": "https://myanimelist.net/anime/40748/Jujutsu_Kaisen_TV",
            "ranking": 53,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1171/109222.jpg?s=f5508bab9e7d610a28f12d1828a6ee79",
            "title": "Jujutsu Kaisen (TV)",
            "hasRanking": true,
            "alternativeTitles": [
                "Sorcery Fight",
                "JJK",
                "呪術廻戦",
                "Jujutsu Kaisen",
                "Jujutsu Kaisen",
                "Jujutsu Kaisen",
                "Jujutsu Kaisen"
            ],
            "episodes": 24,
            "genres": [
                "Action",
                "Fantasy"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Idly indulging in baseless paranormal activities with the Occult Club, high schooler Yuuji Itadori spends his days at either the clubroom or the hospital, where he visits his bedridden grandfather. However, this leisurely lifestyle soon takes a turn for the strange when he unknowingly encounters a cursed item. Triggering a chain of supernatural occurrences, Yuuji finds himself suddenly thrust into the world of Curses—dreadful beings formed from human malice and negativity—after swallowing the said item, revealed to be a finger belonging to the demon Sukuna Ryoumen, the \"King of Curses.\"\n\nYuuji experiences first-hand the threat these Curses pose to society as he discovers his own newfound powers. Introduced to the Tokyo Metropolitan Jujutsu Technical High School, he begins to walk down a path from which he cannot return—the path of a Jujutsu sorcerer.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "34599",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/6/86733.jpg",
            "link": "https://myanimelist.net/anime/34599/Made_in_Abyss",
            "ranking": 54,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/86733.jpg?s=56ac623880ec87f3a0197e0391bc12c3",
            "title": "Made in Abyss",
            "hasRanking": true,
            "alternativeTitles": [
                "メイドインアビス",
                "Made in Abyss"
            ],
            "episodes": 13,
            "genres": [
                "Adventure",
                "Drama",
                "Fantasy",
                "Mystery",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "The Abyss—a gaping chasm stretching down into the depths of the earth, filled with mysterious creatures and relics from a time long past. How did it come to be? What lies at the bottom? Countless brave individuals, known as Divers, have sought to solve these mysteries of the Abyss, fearlessly descending into its darkest realms. The best and bravest of the Divers, the White Whistles, are hailed as legends by those who remain on the surface.\n\nRiko, daughter of the missing White Whistle Lyza the Annihilator, aspires to become like her mother and explore the furthest reaches of the Abyss. However, just a novice Red Whistle herself, she is only permitted to roam its most upper layer. Even so, Riko has a chance encounter with a mysterious robot with the appearance of an ordinary young boy. She comes to name him Reg, and he has no recollection of the events preceding his discovery. Certain that the technology to create Reg must come from deep within the Abyss, the two decide to venture forth into the chasm to recover his memories and see the bottom of the great pit with their own eyes. However, they know not of the harsh reality that is the true existence of the Abyss.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "36862",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1502/110723.jpg",
            "link": "https://myanimelist.net/anime/36862/Made_in_Abyss_Movie_3__Fukaki_Tamashii_no_Reimei",
            "ranking": 55,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1502/110723.jpg?s=371a6b383817649bb1d3468f03522f66",
            "title": "Made in Abyss Movie 3: Fukaki Tamashii no Reimei",
            "hasRanking": true,
            "alternativeTitles": [
                "Gekijouban Made in Abyss: Fukaki Tamashii no Reimei",
                "Made in Abyss: Dawn of the Deep Soul",
                "劇場版メイドインアビス 深き魂の黎明",
                "Made in Abyss: Dawn of the Deep Soul",
                "Made in Abyss: Seelen der Finsternis",
                "Made in Abyss : L'Aurore de L’Âme des Profondeurs"
            ],
            "episodes": 1,
            "genres": [
                "Adventure",
                "Drama",
                "Fantasy",
                "Mystery",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Continuing their perilous descent down the Abyss, Riko, Regu, and newfound friend Nanachi reach the Abyss' fifth layer, The Sea of Corpses. Upon arriving at the research station known as Idofront, the main trio encounter the mysterious Prushka, the alleged daughter of Bondrewd, who leads them to the White Whistle responsible for Nanachi's dark past. Despite the welcoming appearances of Idofront's residents, Nanachi warns the young adventurers that things are not always what they seem. With the only route to the sixth layer shrouded in mystery and Bonedrewd's schemes awaiting them, what sacrifices must be made in order to continue the journey down to the bottom of the Abyss?\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "457",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/2/73862.jpg",
            "link": "https://myanimelist.net/anime/457/Mushishi",
            "ranking": 56,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/2/73862.jpg?s=d976f75f480430a0c9fde4455696131d",
            "title": "Mushishi",
            "hasRanking": true,
            "alternativeTitles": [
                "蟲師",
                "Mushi-Shi",
                "Mushi-Shi",
                "Mushi-Shi",
                "Mushi-Shi"
            ],
            "episodes": 26,
            "genres": [
                "Adventure",
                "Fantasy",
                "Mystery",
                "Slice of Life",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "\"Mushi\": the most basic forms of life in the world. They exist without any goals or purposes aside from simply \"being.\" They are beyond the shackles of the words \"good\" and \"evil.\" Mushi can exist in countless forms and are capable of mimicking things from the natural world such as plants, diseases, and even phenomena like rainbows.\n\nThis is, however, just a vague definition of these entities that inhabit the vibrant world of Mushishi, as to even call them a form of life would be an oversimplification. Detailed information on Mushi is scarce because the majority of humans are unaware of their existence.\n\nSo what are Mushi and why do they exist? This is the question that a \"Mushishi,\" Ginko, ponders constantly. Mushishi are those who research Mushi in hopes of understanding their place in the world's hierarchy of life.\n\nGinko chases rumors of occurrences that could be tied to Mushi, all for the sake of finding an answer.\n\nIt could, after all, lead to the meaning of life itself.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "33352",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1795/95088.jpg",
            "link": "https://myanimelist.net/anime/33352/Violet_Evergarden",
            "ranking": 57,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1795/95088.jpg?s=9e24a139603a4e0ea8ea055a230b54d5",
            "title": "Violet Evergarden",
            "hasRanking": true,
            "alternativeTitles": [
                "ヴァイオレット・エヴァーガーデン",
                "Violet Evergarden"
            ],
            "episodes": 13,
            "genres": [
                "Drama",
                "Fantasy",
                "Slice of Life"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "The Great War finally came to an end after four long years of conflict; fractured in two, the continent of Telesis slowly began to flourish once again. Caught up in the bloodshed was Violet Evergarden, a young girl raised for the sole purpose of decimating enemy lines. Hospitalized and maimed in a bloody skirmish during the War's final leg, she was left with only words from the person she held dearest, but with no understanding of their meaning.\n\nRecovering from her wounds, Violet starts a new life working at CH Postal Services after a falling out with her new intended guardian family. There, she witnesses by pure chance the work of an \"Auto Memory Doll,\" amanuenses that transcribe people's thoughts and feelings into words on paper. Moved by the notion, Violet begins work as an Auto Memory Doll, a trade that will take her on an adventure, one that will reshape the lives of her clients and hopefully lead to self-discovery.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "23273",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/3/67177.jpg",
            "link": "https://myanimelist.net/anime/23273/Shigatsu_wa_Kimi_no_Uso",
            "ranking": 58,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/3/67177.jpg?s=bc267f764bffe825e1e8d60f7185a2e9",
            "title": "Shigatsu wa Kimi no Uso",
            "hasRanking": true,
            "alternativeTitles": [
                "Kimiuso",
                "四月は君の嘘",
                "Your Lie in April",
                "Shigatsu Wa Kimi No Uso - Sekunden in Moll",
                "Your Lie in April",
                "Your Lie in April"
            ],
            "episodes": 22,
            "genres": [
                "Drama",
                "Romance"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Kousei Arima is a child prodigy known as the \"Human Metronome\" for playing the piano with precision and perfection. Guided by a strict mother and rigorous training, Kousei dominates every competition he enters, earning the admiration of his musical peers and praise from audiences. When his mother suddenly passes away, the subsequent trauma makes him unable to hear the sound of a piano, and he never takes the stage thereafter.\n\nNowadays, Kousei lives a quiet and unassuming life as a junior high school student alongside his friends Tsubaki Sawabe and Ryouta Watari. While struggling to get over his mother's death, he continues to cling to music. His monochrome life turns upside down the day he encounters the eccentric violinist Kaori Miyazono, who thrusts him back into the spotlight as her accompanist. Through a little lie, these two young musicians grow closer together as Kaori tries to fill Kousei's world with color.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "5258",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/8/56617.jpg",
            "link": "https://myanimelist.net/anime/5258/Hajime_no_Ippo__New_Challenger",
            "ranking": 59,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/8/56617.jpg?s=4c8a3a8180c114c3771eb183e5318a0e",
            "title": "Hajime no Ippo: New Challenger",
            "hasRanking": true,
            "alternativeTitles": [
                "Hajime no Ippo New Series",
                "Hajime no Ippo Season II",
                "Hajime no Ippo 2",
                "はじめの一歩 新シリーズ",
                "Fighting Spirit: New Challenger",
                "Hajime no Ippo: The Fighting. New Challenger"
            ],
            "episodes": 26,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Japanese Featherweight Champion Ippo Makunouchi has successfully defended and retained his title. Meanwhile, his rival, Ichirou Miyata, has resurfaced in Japan, aiming for his own Featherweight belt in the Oriental Pacific Boxing Federation. When the rest of the world comes knocking, however, will Japan's best fighters rise to the challenge and achieve glory at the top? Or will the small island nation be crushed under the weight of greater entities? This time, champions will become challengers issuing a call to the rest of the world and ready to show off their fighting spirit!\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "431",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/5/75810.jpg",
            "link": "https://myanimelist.net/anime/431/Howl_no_Ugoku_Shiro",
            "ranking": 60,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/5/75810.jpg?s=2b3056507119467116017b42d3e1da8b",
            "title": "Howl no Ugoku Shiro",
            "hasRanking": true,
            "alternativeTitles": [
                "ハウルの動く城",
                "Howl's Moving Castle",
                "Das wandelnde Schloss",
                "El Castillo Ambulante",
                "Le Château ambulant"
            ],
            "episodes": 1,
            "genres": [
                "Adventure",
                "Drama",
                "Fantasy",
                "Romance"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "That jumbled piece of architecture, that cacophony of hissing steam and creaking joints, with smoke billowing from it as it moves on its own... That castle is home to the magnificent wizard Howl, infamous for both his magical prowess and for being a womanizer—or so the rumor goes in Sophie Hatter's small town. Sophie, as the plain daughter of a hatmaker, does not expect much from her future and is content with working hard in the shop. \n\nHowever, Sophie's simple life takes a turn for the exciting when she is ensnared in a disturbing situation, and the mysterious wizard appears to rescue her. Unfortunately, this encounter, brief as it may be, spurs the vain and vengeful Witch of the Waste—in a fit of jealousy caused by a past discord with Howl—to put a curse on the maiden, turning her into an old woman.\n\nIn an endeavor to return to normal, Sophie must accompany Howl and a myriad of eccentric companions—ranging from a powerful fire demon to a hopping scarecrow—in his living castle, on a dangerous adventure as a raging war tears their kingdom apart.\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "40456",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1704/106947.jpg",
            "link": "https://myanimelist.net/anime/40456/Kimetsu_no_Yaiba_Movie__Mugen_Ressha-hen",
            "ranking": 61,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1704/106947.jpg?s=685b7fa652f5b3df29bd20fc2c8cb32e",
            "title": "Kimetsu no Yaiba Movie: Mugen Ressha-hen",
            "hasRanking": true,
            "alternativeTitles": [
                "Gekijouban Kimetsu no Yaiba: Mugen Ressha-hen",
                "Kimetsu no Yaiba: Infinity Train",
                "Demon Slayer Movie: Infinity Train",
                "劇場版 鬼滅の刃 無限列車編",
                "Demon Slayer -Kimetsu no Yaiba- The Movie: Mugen Train",
                "Guardianes De La Noche  - Kimetsu No Yaiba - Tren Infinito",
                "Demon Slayer - Kimetsu no Yaiba - Le film : Le train de l'Infini"
            ],
            "episodes": 1,
            "genres": [
                "Action",
                "Fantasy"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "After a string of mysterious disappearances begin to plague a train, the Demon Slayer Corps' multiple attempts to remedy the problem prove fruitless. To prevent further casualties, the Flame Pillar, Kyoujurou Rengoku, takes it upon himself to eliminate the threat. Accompanying him are some of the Corps' most promising new blood: Tanjirou Kamado, Zenitsu Agatsuma, and Inosuke Hashibira, who all hope to witness the fiery feats of this model demon slayer firsthand.\n\nUnbeknownst to them, the demonic forces responsible for the disappearances have already put their sinister plan in motion. Under this demonic presence, the group must muster every ounce of their willpower and draw their swords to save all two hundred passengers onboard. Kimetsu no Yaiba Movie: Mugen Ressha-hen delves into the deepest corners of Tanjirou's mind, putting his resolve and commitment to duty to the test.\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "28891",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/9/76662.jpg",
            "link": "https://myanimelist.net/anime/28891/Haikyuu_Second_Season",
            "ranking": 62,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/9/76662.jpg?s=06ccfffc7b27ac5532d268b9934a224a",
            "title": "Haikyuu!! Second Season",
            "hasRanking": true,
            "alternativeTitles": [
                "Haikyuu!! Second Season",
                "ハイキュー!! セカンドシーズン",
                "Haikyu!! 2nd Season",
                "Haikyu!! Staffel 2",
                "Haikyu!! Los Ases del Vóley Temporada 2",
                "Haikyu!! Saison 2"
            ],
            "episodes": 25,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Following their participation at the Inter-High, the Karasuno High School volleyball team attempts to refocus their efforts, aiming to conquer the Spring tournament instead. \n\nWhen they receive an invitation from long-standing rival Nekoma High, Karasuno agrees to take part in a large training camp alongside many notable volleyball teams in Tokyo and even some national level players. By playing with some of the toughest teams in Japan, they hope not only to sharpen their skills, but also come up with new attacks that would strengthen them. Moreover, Hinata and Kageyama attempt to devise a more powerful weapon, one that could possibly break the sturdiest of blocks. \n\nFacing what may be their last chance at victory before the senior players graduate, the members of Karasuno's volleyball team must learn to settle their differences and train harder than ever if they hope to overcome formidable opponents old and new—including their archrival Aoba Jousai and its world-class setter Tooru Oikawa.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "40591",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1764/106659.jpg",
            "link": "https://myanimelist.net/anime/40591/Kaguya-sama_wa_Kokurasetai_Tensai-tachi_no_Renai_Zunousen",
            "ranking": 63,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1764/106659.jpg?s=aab19d0f19e345e223dc26542ac3a28f",
            "title": "Kaguya-sama wa Kokurasetai? Tensai-tachi no Renai Zunousen",
            "hasRanking": true,
            "alternativeTitles": [
                "Kaguya Wants to be Confessed To: The Geniuses' War of Love and Brains 2nd Season",
                "Kaguya-sama wa Kokurasetai: Tensai-tachi no Renai Zunousen 2nd Season",
                "Kaguya-sama: Love is War 2nd Season",
                "かぐや様は告らせたい？～天才たちの恋愛頭脳戦～",
                "Kaguya-sama: Love is War Season 2",
                "Kaguya-sama: Love Is War Staffel 2",
                "Kaguya-sama: Love Is War? Temporada 2",
                "Kaguya-sama: Love is War Saison 2"
            ],
            "episodes": 12,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "After a slow but eventful summer vacation, Shuchiin Academy's second term is now starting in full force. As August transitions into September, Miyuki Shirogane's birthday looms ever closer, leaving Kaguya Shinomiya in a serious predicament as to how to celebrate it. Furthermore, the tenure of the school's 67th student council is coming to an end. Due to the council members being in different classes, the only time Kaguya and Miyuki have to be together will soon disappear, putting all of their cunning plans at risk.\n\nA long and difficult election that will decide the fate of the new student council awaits, as multiple challengers fight for the coveted title of president.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "11665",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/3/37449.jpg",
            "link": "https://myanimelist.net/anime/11665/Natsume_Yuujinchou_Shi",
            "ranking": 64,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/3/37449.jpg?s=2bb045b3120e6a3a23257bb39689ae30",
            "title": "Natsume Yuujinchou Shi",
            "hasRanking": true,
            "alternativeTitles": [
                "Natsume Yuujinchou Four",
                "Natsume Yuujinchou 4",
                "Natsume Yujincho 4",
                "夏目友人帳 肆",
                "Natsume's Book of Friends Season 4",
                "Natsume Yujin-cho Staffel 4",
                "Natsume Yujin-cho Temporada 4",
                "Natsume Yujin-cho Saison 4"
            ],
            "episodes": 13,
            "genres": [
                "Drama",
                "Slice of Life",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Takashi Natsume, the timid youkai expert and master of the Book of Friends, continues his journey towards self-understanding and acceptance with the help of friends both new and old. His most important ally is still his gluttonous and sake-loving bodyguard, the arrogant but fiercely protective wolf spirit Madara—or Nyanko-sensei, as Madara is called when in his usual disguise of an unassuming, pudgy cat.\n\nNatsume, while briefly separated from Nyanko-sensei, is ambushed and kidnapped by a strange group of masked, monkey-like youkai, who have spirited him away to their forest as they desperately search for the Book of Friends. Realizing that his \"servant\" has been taken out from right under his nose, Nyanko-sensei enlists the help of Natsume's youkai friends and mounts a rescue operation. However, the forest of the monkey spirits holds many dangerous enemies, including the Matoba Clan, Natsume's old nemesis.\n\nStretching from the formidable hideout of the Matoba to Natsume's own childhood home, Natsume Yuujinchou Shi is a sweeping but familiar return to a world of danger and friendship, where Natsume will finally confront the demons of his own past.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "21",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/6/73245.jpg",
            "link": "https://myanimelist.net/anime/21/One_Piece",
            "ranking": 65,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/73245.jpg?s=f792b8c9e28534ae455d06b15e686a14",
            "title": "One Piece",
            "hasRanking": true,
            "alternativeTitles": [
                "OP",
                "ONE PIECE",
                "One Piece"
            ],
            "episodes": null,
            "genres": [
                "Action",
                "Adventure",
                "Fantasy"
            ],
            "hasEpisode": false,
            "status": "Currently Airing",
            "synopsis": "Gol D. Roger was known as the \"Pirate King,\" the strongest and most infamous being to have sailed the Grand Line. The capture and execution of Roger by the World Government brought a change throughout the world. His last words before his death revealed the existence of the greatest treasure in the world, One Piece. It was this revelation that brought about the Grand Age of Pirates, men who dreamed of finding One Piece—which promises an unlimited amount of riches and fame—and quite possibly the pinnacle of glory and the title of the Pirate King.\n\nEnter Monkey D. Luffy, a 17-year-old boy who defies your standard definition of a pirate. Rather than the popular persona of a wicked, hardened, toothless pirate ransacking villages for fun, Luffy's reason for being a pirate is one of pure wonder: the thought of an exciting adventure that leads him to intriguing people and ultimately, the promised treasure. Following in the footsteps of his childhood hero, Luffy and his crew travel across the Grand Line, experiencing crazy adventures, unveiling dark mysteries and battling strong enemies, all in order to reach the most coveted of all fortunes—One Piece.\n\n[Written by MAL Rewrite] ",
            "type": "TV"
        },
        {
            "_id": "3786",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1422/113533.jpg",
            "link": "https://myanimelist.net/anime/3786/Evangelion__30_10_Thrice_Upon_a_Time",
            "ranking": 66,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1422/113533.jpg?s=1e4f4aa0e597b1c1f082779ab9baa2fc",
            "title": "Evangelion: 3.0+1.0 Thrice Upon a Time",
            "hasRanking": true,
            "alternativeTitles": [
                "Evangelion: 4.0",
                "Rebuild of Evangelion",
                "Shin Evangelion Gekijouban: ||",
                "Rebuild of Evangelion: Final",
                "シン・エヴァンゲリオン劇場版:||",
                "Evangelion: 3.0+1.0 Thrice Upon a Time"
            ],
            "episodes": 1,
            "genres": [
                "Action",
                "Drama",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Following NERV's failed attempt to retrieve the Spears of Longinus and carry out the Human Instrumentality Project, the destruction caused by the Fourth Impact has been largely averted. In a state of disarray, Shinji Ikari, Asuka Langley Shikinami, and Rei Ayanami travel to Village 3—a survivor settlement free from Earth's ruination. There, Shinji slowly comes to terms with his past, developing an entirely different life from his days as an Evangelion pilot.\n\nMeanwhile, Nerv makes preparations to continue the Instrumentality Project by means of a new Impact. When WILLE's main aerial battleship arrives at the village, Shinji decides to board, believing that he can help by piloting an Evangelion. As new secrets are uncovered and a battle between WILLE and NERV approaches, the future of Earth hangs in the balance. Can Shinji save humanity and the rest of the world one last time?\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "34591",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/6/84416.jpg",
            "link": "https://myanimelist.net/anime/34591/Natsume_Yuujinchou_Roku",
            "ranking": 67,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/84416.jpg?s=931f8a6bfc42adf9257eeb7641bad75e",
            "title": "Natsume Yuujinchou Roku",
            "hasRanking": true,
            "alternativeTitles": [
                "Natsume Yuujinchou Season 6",
                "Natsume's Book of Friends Six",
                "夏目友人帳 陸",
                "Natsume's Book of Friends Season 6",
                "Natsume Yujin-cho 6",
                "Natsume Yujin-cho 6",
                "Natsume Yujin-cho 6"
            ],
            "episodes": 11,
            "genres": [
                "Drama",
                "Slice of Life",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Takashi Natsume has grown accustomed to his encounters with youkai through the Book of Friends, which contains the names of youkai whom his grandmother, Reiko Natsume, has sealed in contracts. These encounters allow Natsume to better understand the youkai, Reiko, and himself. \n\nThe Book of Friends is a powerful tool that can be used to control youkai; it is sought after by both youkai and exorcists alike. Natsume just wants to live out his daily life in peace but is constantly disrupted by these experiences. If he is to end this torment, Natsume must explore more about the book and the world of exorcism, as well as begin to open his heart to those who can help him.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "40834",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1347/117616.jpg",
            "link": "https://myanimelist.net/anime/40834/Ousama_Ranking",
            "ranking": 68,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1347/117616.jpg?s=1fc7d9cfcad3dfca1cee2e11b5b74ef4",
            "title": "Ousama Ranking",
            "hasRanking": true,
            "alternativeTitles": [
                "King Ranking",
                "王様ランキング",
                "Ranking of Kings"
            ],
            "episodes": 23,
            "genres": [
                "Adventure",
                "Fantasy"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "The people of the kingdom look down on the young Prince Bojji, who can neither hear nor speak. They call him \"The Useless Prince\" while jeering at his supposed foolishness.\n\nHowever, while Bojji may not be physically strong, he is certainly not weak of heart. When a chance encounter with a shadow creature should have left him traumatized, it instead makes him believe that he has found a friend amidst those who only choose to notice his shortcomings. He starts meeting with Kage, the shadow, regularly, to the point where even the otherwise abrasive creature begins to warm up to him.\n\nKage and Bojji's unlikely friendship lays the budding foundations of the prince's journey, one where he intends to conquer his fears and insecurities. Despite the constant ridicule he faces, Bojji resolves to fulfill his desire of becoming the best king he can be.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "2001",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/4/5123.jpg",
            "link": "https://myanimelist.net/anime/2001/Tengen_Toppa_Gurren_Lagann",
            "ranking": 69,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/4/5123.jpg?s=15bb64e0c8b13acfa5d0761308b66f59",
            "title": "Tengen Toppa Gurren Lagann",
            "hasRanking": true,
            "alternativeTitles": [
                "Tengen Toppa Gurren-Lagann",
                "Making Break-Through Gurren Lagann",
                "Heavenly Breakthrough Gurren Lagann",
                "TTGL",
                "Gurren Laggan",
                "天元突破グレンラガン",
                "Gurren Lagann",
                "Gurren Lagann",
                "Gurren Lagann",
                "Gurren Lagann"
            ],
            "episodes": 27,
            "genres": [
                "Action",
                "Adventure",
                "Comedy",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Simon and Kamina were born and raised in a deep, underground village, hidden from the fabled surface. Kamina is a free-spirited loose cannon bent on making a name for himself, while Simon is a timid young boy with no real aspirations. One day while excavating the earth, Simon stumbles upon a mysterious object that turns out to be the ignition key to an ancient artifact of war, which the duo dubs Lagann. Using their new weapon, Simon and Kamina fend off a surprise attack from the surface with the help of Yoko Littner, a hot-blooded redhead wielding a massive gun who wanders the world above.\n\nIn the aftermath of the battle, the sky is now in plain view, prompting Simon and Kamina to set off on a journey alongside Yoko to explore the wastelands of the surface. Soon, they join the fight against the \"Beastmen,\" humanoid creatures that terrorize the remnants of humanity in powerful robots called \"Gunmen.\" Although they face some challenges and setbacks, the trio bravely fights these new enemies alongside other survivors to reclaim the surface, while slowly unraveling a galaxy-sized mystery.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "22135",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/10/58041.jpg",
            "link": "https://myanimelist.net/anime/22135/Ping_Pong_the_Animation",
            "ranking": 70,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/10/58041.jpg?s=fbfd98389b5a6f1a27979446e3f07abe",
            "title": "Ping Pong the Animation",
            "hasRanking": true,
            "alternativeTitles": [
                "PPTA",
                "ピンポン THE ANIMATION",
                "Ping Pong the Animation"
            ],
            "episodes": 11,
            "genres": [
                "Drama",
                "Sports"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Despite being polar opposites, Makoto \"Smile\" Tsukimoto and Yutaka \"Peco\" Hoshino have been best friends since childhood. Although the overly confident Peco strives to be the best ping-pong player in the world, he often skips practice, earning the ire of his fellow teammates on the Katase High School ping-pong team. Meanwhile, Smile—in spite of his innate talent for the sport—cannot help but hold back his full strength when playing against others. Through their mutual love for ping-pong, the two have developed a bond that is seemingly unbreakable.\n\nWhen Peco hears that an ex-national team player from China is coming to Japan, he drags Smile over to rival Tsujido High School to observe them. The subsequent trip leads to a clash between Peco and Kong Wenge, who overwhelmingly defeats the former in one game. Stunned by such a comprehensive loss, Peco finds himself questioning why he plays to begin with. Seeing his potential as a player, Katase's coach begins to train Smile to overcome his hesitation, but he is reluctant to play if it is not for enjoyment.\n\nAs the two struggle to find meaning in the sport, a plethora of stronger players—each with their own internal strifes—await them at the inter-high tournament, where only the very best can persevere. But when these young athletes let their unbridled ambition go unchecked, the hardships they face paint a somber reality as they pursue glory.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "38329",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1613/102179.jpg",
            "link": "https://myanimelist.net/anime/38329/Seishun_Buta_Yarou_wa_Yumemiru_Shoujo_no_Yume_wo_Minai",
            "ranking": 71,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1613/102179.jpg?s=9b762a892eac987081bada93be8d3bdc",
            "title": "Seishun Buta Yarou wa Yumemiru Shoujo no Yume wo Minai",
            "hasRanking": true,
            "alternativeTitles": [
                "青春ブタ野郎はゆめみる少女の夢を見ない",
                "Rascal Does Not Dream of a Dreaming Girl",
                "Rascal Does Not Dream of a Dreaming Girl",
                "Rascal Does Not Dream of a Dreaming Girl"
            ],
            "episodes": 1,
            "genres": [
                "Drama",
                "Romance",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Six months ago, Sakuta Azusagawa had a chance encounter with a bunny girl in a library. Ever since then, he's been blissfully happy with his girlfriend: Mai Sakurajima, that same bunny girl. However, the reappearance of his mysterious first crush, the now-adult Shouko Makinohara, adds a new complication to his relationship with Mai. To make matters worse, he then encounters a middle school Shouko in the hospital, suffering from a grave illness. Mysteriously, his old scars begin throbbing whenever he's near her.\n\nWith Shouko's bizarre situation somehow revolving around him, Sakuta will need to come to terms with his own conflicting feelings, for better or worse. With a girl's life in his hands, just what can he do?\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "35760",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1173/92110.jpg",
            "link": "https://myanimelist.net/anime/35760/Shingeki_no_Kyojin_Season_3",
            "ranking": 72,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1173/92110.jpg?s=410d006fea0608544e9861a6f261c692",
            "title": "Shingeki no Kyojin Season 3",
            "hasRanking": true,
            "alternativeTitles": [
                "進撃の巨人 Season3",
                "Attack on Titan Season 3",
                "Attack on Titan 3. Staffel",
                "Ataque a los Titanes Temporada 3",
                "L'Attaque des Titans Saison 3"
            ],
            "episodes": 12,
            "genres": [
                "Action",
                "Drama"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Still threatened by the \"Titans\" that rob them of their freedom, mankind remains caged inside the two remaining walls. Efforts to eradicate these monsters continue; however, threats arise not only from the Titans beyond the walls, but from the humans within them as well.\n\nAfter being rescued from the Colossal and Armored Titans, Eren Yaeger devotes himself to improving his Titan form. Krista Lenz struggles to accept the loss of her friend, Captain Levi chooses Eren and his friends to form his new personal squad, and Commander Erwin Smith recovers from his injuries. All seems well for the soldiers, until the government suddenly demands custody of Eren and Krista. The Survey Corps' recent successes have drawn attention, and a familiar face from Levi's past is sent to collect the wanted soldiers. Sought after by the government, Levi and his new squad must evade their adversaries in hopes of keeping Eren and Krista safe.\n\nIn Shingeki no Kyojin Season 3, Eren and his fellow soldiers are not only fighting for their survival against the terrifying Titans, but also against the terror of a far more conniving foe: humans.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "7311",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1248/112352.jpg",
            "link": "https://myanimelist.net/anime/7311/Suzumiya_Haruhi_no_Shoushitsu",
            "ranking": 73,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1248/112352.jpg?s=e62fda44bb62e1b938570096c39f9d05",
            "title": "Suzumiya Haruhi no Shoushitsu",
            "hasRanking": true,
            "alternativeTitles": [
                "The Vanishment of Haruhi Suzumiya",
                "Suzumiya Haruhi no Syoshitsu",
                "Haruhi Movie",
                "涼宮ハルヒの消失",
                "The Disappearance of Haruhi Suzumiya",
                "Das Verschwinden der Haruhi Suzumiya der Film",
                "La Disparition de Haruhi Suzumiya la Film"
            ],
            "episodes": 1,
            "genres": [
                "Mystery",
                "Sci-Fi",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "On a cold December day, Kyon arrives at school prepared for another outing with his fellow SOS Brigade members. However, much to his surprise, he discovers that almost everything has changed completely: Haruhi Suzumiya and Itsuki Koizumi are nowhere to be found; Mikuru Asahina does not recognize him at all; Yuki Nagato is a regular human; and Ryouko Asakura has mysteriously returned. Although he is no stranger to the supernatural, Kyon is disturbed by this odd turn of events and decides to investigate on his own.\n\nFinding himself to be the only person that is aware of the previous reality, Kyon is now faced with a difficult choice: to finally live the normal life he has always wanted, or uncover a way to turn back the hands of time and restore his chaotic yet familiar world.\n\n[Written by MAL Rewrite]\n",
            "type": "Movie"
        },
        {
            "_id": "1535",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/9/9453.jpg",
            "link": "https://myanimelist.net/anime/1535/Death_Note",
            "ranking": 74,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/9/9453.jpg?s=b89e80691ac5cc0610847ccbe0b8424a",
            "title": "Death Note",
            "hasRanking": true,
            "alternativeTitles": [
                "DN",
                "デスノート",
                "Death Note"
            ],
            "episodes": 37,
            "genres": [
                "Supernatural",
                "Suspense"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Brutal murders, petty thefts, and senseless violence pollute the human world. In contrast, the realm of death gods is a humdrum, unchanging gambling den. The ingenious 17-year-old Japanese student Light Yagami and sadistic god of death Ryuk share one belief: their worlds are rotten.\n\nFor his own amusement, Ryuk drops his \"Death Note\" into the human world. Light stumbles upon it, deeming the first of its rules ridiculous: the human whose name is written in this note shall die. However, the temptation is too great, and Light experiments by writing a felon's name, which disturbingly enacts his first murder.\n\nAware of the terrifying godlike power that has fallen into his hands, Light—under the alias \"Kira\"—follows his wicked sense of justice with the ultimate goal of cleansing the world of all evil-doers. The meticulous mastermind detective L is already on his trail, but as Light's brilliance rivals L's, the grand chase for Kira turns into an intense battle of wits that can only end when one of them is dead.\n\n[Written by MAL Rewrite]\n",
            "type": "TV"
        },
        {
            "_id": "49310",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1034/120096.jpg",
            "link": "https://myanimelist.net/anime/49310/Fruits_Basket__Prelude",
            "ranking": 75,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1034/120096.jpg?s=e71de341b6c0e5917e24da0be9af35dd",
            "title": "Fruits Basket: Prelude",
            "hasRanking": true,
            "alternativeTitles": [
                "Kyouko to Katsuya no Monogatari",
                "The Story of Kyoko and Katsuya",
                "フルーツバスケット -prelude-"
            ],
            "episodes": 1,
            "genres": [
                "Drama",
                "Romance"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "The film will serve as an omnibus to the three-season anime series, including the Kyouko to Katsuya no Monogatari (The Story of Kyouko and Katsuya) prequel, as well as new scenes written by the original creator Natsuki Takaya taking place after the television anime.\n\n(Source: MAL News)",
            "type": "Movie"
        },
        {
            "_id": "28957",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/9/72689.jpg",
            "link": "https://myanimelist.net/anime/28957/Mushishi_Zoku_Shou__Suzu_no_Shizuku",
            "ranking": 76,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/9/72689.jpg?s=58cb067cc48352b42e376589c0b4dfcc",
            "title": "Mushishi Zoku Shou: Suzu no Shizuku",
            "hasRanking": true,
            "alternativeTitles": [
                "Mushishi Tokubetsu-hen: Suzu no Shizuku",
                "Mushishi: The Next Chapter - Drops of Bells",
                "蟲師 続章: 鈴の雫"
            ],
            "episodes": 1,
            "genres": [
                "Adventure",
                "Fantasy",
                "Mystery",
                "Slice of Life",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "On a warm summer day, a boy heard the sound of bells ringing, as if in celebration, in the mountain near his home. Several years later in that same mountain, the mushishi Ginko encounters a strange girl with weeds growing out of her body. Soon after, Ginko coincidentally runs into the now grown-up boy Yoshiro on his way off the mountain. With Yoshiro's help, Ginko soon begins to uncover who this mysterious girl is and what happened to her.\n\nAn adaptation of the last arc in the manga, Mushishi Zoku Shou: Suzu no Shizuku follows Ginko's peculiar journey amidst the occult to unravel the mystery behind the enigmatic girl called Kaya and the mountain that has become her home.\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "12355",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/9/35721.jpg",
            "link": "https://myanimelist.net/anime/12355/Ookami_Kodomo_no_Ame_to_Yuki",
            "ranking": 77,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/9/35721.jpg?s=3cb7f7062c2ef1c69ab18d7e3c04af2b",
            "title": "Ookami Kodomo no Ame to Yuki",
            "hasRanking": true,
            "alternativeTitles": [
                "The Wolf Children Ame and Yuki",
                "おおかみこどもの雨と雪",
                "Wolf Children",
                "Ame & Yuki: Die Wolfskinder",
                "Wolf Children: Los Niños Lobo",
                "Les Enfants Loups: Ame & Yuki"
            ],
            "episodes": 1,
            "genres": [
                "Fantasy",
                "Slice of Life"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Hana, a hard-working college student, falls in love with a mysterious man who attends one of her classes though he is not an actual student. As it turns out, he is not truly human either. On a full moon night, he transforms, revealing that he is the last werewolf alive. Despite this, Hana's love remains strong, and the two ultimately decide to start a family.\n\nHana gives birth to two healthy children—Ame, born during rainfall, and Yuki, born during snowfall—both possessing the ability to turn into wolves, a trait inherited from their father. All too soon, however, the sudden death of her lover devastates Hana's life, leaving her to raise a peculiar family completely on her own. The stress of raising her wild-natured children in a densely populated city, all while keeping their identity a secret, culminates in a decision to move to the countryside, where she hopes Ame and Yuki can live a life free from the judgments of society. Wolf Children is the heartwarming story about the challenges of being a single mother in an unforgiving modern world.\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "19647",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/6/56147.jpg",
            "link": "https://myanimelist.net/anime/19647/Hajime_no_Ippo__Rising",
            "ranking": 78,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/56147.jpg?s=7e50339d044aed8909d36bb9afa331d3",
            "title": "Hajime no Ippo: Rising",
            "hasRanking": true,
            "alternativeTitles": [
                "Fighting Spirit: Rising",
                "Hajime no Ippo 3",
                "はじめの一歩 Rising",
                "Hajime No Ippo: The Fighting!",
                "Hajime No Ippo: The Fighting! - Rising",
                "Hajime No Ippo: The Fighting!",
                "Hajime No Ippo: The Fighting! - Rising"
            ],
            "episodes": 25,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Japanese Featherweight Champion Makunouchi Ippo has defended his title belt once more with the help of his devastating signature move: the Dempsey Roll. However, new challengers are rising up left and right, claiming to have an answer for the move responsible for crushing his opponents. Will Ippo be able to step up to the challenge, or will the weight of his pride destroy him before he finds out just what it means to be strong? Meanwhile, fellow Kamogawa Gym mate Aoki Masaru is just a hop, skip, and a Frog Punch away from claiming his own belt, ready to take on the Japanese Lightweight Champion!\n\nHajime no Ippo: Rising continues Ippo's quest to become stronger, featuring the same cast of loveable dimwits from Kamogawa Gym, as they put their bodies and hearts on the line to make their way in the harsh world of professional boxing. With a will of iron, Ippo steps into the ring once again.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "31757",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1981/112812.jpg",
            "link": "https://myanimelist.net/anime/31757/Kizumonogatari_II__Nekketsu-hen",
            "ranking": 79,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1981/112812.jpg?s=be1337b450cee892a1083242c5e526c2",
            "title": "Kizumonogatari II: Nekketsu-hen",
            "hasRanking": true,
            "alternativeTitles": [
                "Koyomi Vamp",
                "Kizumonogatari Part 2",
                "傷物語〈Ⅱ熱血篇〉",
                "Kizumonogatari Part 2: Hot-Blooded",
                "Kizumonogatari: Heißes Blut"
            ],
            "episodes": 1,
            "genres": [
                "Action",
                "Mystery",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "No longer truly human, Koyomi Araragi decides to retrieve Kiss-shot Acerola-orion Heart-under-blade's severed body parts that were stolen by three powerful vampire hunters. Awaiting him are Dramaturgie, a vampire hunter who is a vampire himself; Episode, a half-vampire with the ability to transform into mist; and Guillotinecutter, a human priest who is the most dangerous of them all.\n\nUnbeknownst to Araragi, each minute he spends trying to retrieve Kiss-shot's limbs makes him less of a human and more of a vampire. Will he be able to keep his wish of becoming human once again by the end of his battles?\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "37991",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1572/95010.jpg",
            "link": "https://myanimelist.net/anime/37991/JoJo_no_Kimyou_na_Bouken_Part_5__Ougon_no_Kaze",
            "ranking": 80,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1572/95010.jpg?s=88db8e76960fce4e7aaa69f71cfbb4cb",
            "title": "JoJo no Kimyou na Bouken Part 5: Ougon no Kaze",
            "hasRanking": true,
            "alternativeTitles": [
                "JoJo's Bizarre Adventure Part 5: Golden Wind",
                "JoJo no Kimyou na Bouken Part 5: Ougon no Kaze",
                "Le Bizzarre Avventure Di GioGio Parte 5: Vento Aureo",
                "ジョジョの奇妙な冒険 黄金の風",
                "JoJo's Bizarre Adventure: Golden Wind",
                "Jojo's Bizarre Adventure: Golden Wind",
                "Jojo's Bizarre Adventure: Golden Wind",
                "JoJo's Bizarre Adventure: Golden Wind"
            ],
            "episodes": 39,
            "genres": [
                "Action",
                "Adventure"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "In the coastal city of Naples, corruption is teeming—the police blatantly conspire with outlaws, drugs run rampant around the youth, and the mafia governs the streets with an iron fist. However, various fateful encounters will soon occur.\n\nEnter Giorno Giovanna, a 15-year-old boy with an eccentric connection to the Joestar family, who makes a living out of part-time jobs and pickpocketing. Furthermore, he is gifted with the unexplained Stand ability to give and create life—growing plants from the ground and turning inanimate objects into live animals, an ability he has dubbed \"Gold Experience.\" Fascinated by the might of local gangsters, Giorno has dreamed of rising up in their ranks and becoming a \"Gang-Star,\" a feat made possible by his encounter with Bruno Bucciarati, a member of the Passione gang with his own sense of justice.\n\nJoJo no Kimyou na Bouken: Ougon no Kaze follows the endeavors of Giorno after joining Bruno's team while working under Passione, fending off other gangsters and secretly plotting to overthrow their mysterious boss.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "32983",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/11/81755.jpg",
            "link": "https://myanimelist.net/anime/32983/Natsume_Yuujinchou_Go",
            "ranking": 81,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/11/81755.jpg?s=54d7dafe4652b04b40d97d5d6d97d18d",
            "title": "Natsume Yuujinchou Go",
            "hasRanking": true,
            "alternativeTitles": [
                "Natsume Yuujinchou Season 5",
                "Natsume's Book of Friends Five",
                "夏目友人帳 伍",
                "Natsume's Book of Friends Season 5",
                "Natsume Yujin-cho 5",
                "Natsume Yujin-cho 5",
                "Natsume Yujin-cho 5"
            ],
            "episodes": 11,
            "genres": [
                "Drama",
                "Slice of Life",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Season 5 of Natsume Yuujinchou.",
            "type": "TV"
        },
        {
            "_id": "10379",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/8/82394.jpg",
            "link": "https://myanimelist.net/anime/10379/Natsume_Yuujinchou_San",
            "ranking": 82,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/8/82394.jpg?s=f3bc38aa1e6c10580687828856d8dc28",
            "title": "Natsume Yuujinchou San",
            "hasRanking": true,
            "alternativeTitles": [
                "Natsume Yuujinchou Three",
                "Natsume Yuujinchou 3",
                "Natsume Yujincho 3",
                "夏目友人帳 参",
                "Natsume's Book of Friends Season 3"
            ],
            "episodes": 13,
            "genres": [
                "Drama",
                "Slice of Life",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Natsume Yuujinchou San follows Takashi Natsume, a boy who is able to see youkai. Natsume and his bodyguard Madara, nicknamed Nyanko-sensei, continue on their quest to release youkai from their contracts in the \"Book of Friends.\"\n\nNatsume comes to terms with his ability to see youkai and stops thinking of it as a curse. As he spends more time with his human and youkai friends, he realizes how much he values them both and decides he doesn't have to choose between the spirit and human worlds to be happy.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "28735",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/2/77907.jpg",
            "link": "https://myanimelist.net/anime/28735/Shouwa_Genroku_Rakugo_Shinjuu",
            "ranking": 83,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/2/77907.jpg?s=29933c26544d4f41ce39d88c586914b7",
            "title": "Shouwa Genroku Rakugo Shinjuu",
            "hasRanking": true,
            "alternativeTitles": [
                "Showa and Genroku Era Lover's Suicide Through Rakugo",
                "昭和元禄落語心中",
                "Showa Genroku Rakugo Shinju",
                "Showa Genroku Rakugo Shinju"
            ],
            "episodes": 13,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Yotarou is a former yakuza member fresh out of prison and fixated on just one thing: rather than return to a life of crime, the young man aspires to take to the stage of rakugo, a traditional Japanese form of comedic storytelling. Inspired during his incarceration by the performance of distinguished practitioner Yakumo Yuurakutei, he sets his mind on meeting the man who changed his life. After hearing Yotarou's desperate appeal for his mentorship, Yakumo is left with no choice but to accept his very first apprentice.\n\nAs he eagerly begins his training, Yotarou meets Konatsu, an abrasive young woman who has been under Yakumo's care ever since her beloved father Sukeroku Yuurakutei, another prolific rakugo performer, passed away. Through her hidden passion, Yotarou is drawn to Sukeroku's unique style of rakugo despite learning under contrasting techniques. Upon seeing this, old memories and feelings return to Yakumo who reminisces about a much earlier time when he made a promise with his greatest rival.\n\nShouwa Genroku Rakugo Shinjuu is a story set in both the past and present, depicting the art of rakugo, the relationships it creates, and the lives and hearts of those dedicated to keeping the unique form of storytelling alive.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "4565",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/12/19698.jpg",
            "link": "https://myanimelist.net/anime/4565/Tengen_Toppa_Gurren_Lagann_Movie_2__Lagann-hen",
            "ranking": 84,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/12/19698.jpg?s=1be69978bb463a9b8284565cbf1bfb2f",
            "title": "Tengen Toppa Gurren Lagann Movie 2: Lagann-hen",
            "hasRanking": true,
            "alternativeTitles": [
                "Tengen Toppa Gurren Lagann Movie 2",
                "劇場版 天元突破グレンラガン 螺巌篇",
                "Gurren Lagann The Movie: The Lights in the Sky are Stars",
                "Gurren Lagann Película II: Las Luces en el Cielo son Estrellas"
            ],
            "episodes": 1,
            "genres": [
                "Action",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Humans have enjoyed their lavish, peaceful, and prosperous lives for seven years since the day the almighty Spiral King was defeated—the day they reclaimed their homeland, Earth. However, the boon of this lifestyle leaves them unprepared when an unknown, hostile threat arises due to the ever-growing human population. This calamity is the Anti-Spiral—a fearsome enemy with unparalleled power. \n \nAs the Spiral King's prognosis postulating the destruction of \"The Spiral's World\" begins to come true, the pieces are in place, and Team Dai-Gurren is ready. With his late brother's hope to see a better future for mankind, Simon—along with Nia Teppelin and the rest of the team—is determined to overthrow the mighty Anti-Spiral in order to revive humanity's lost hope.\n\n[Written by MAL Rewrite]\n",
            "type": "Movie"
        },
        {
            "_id": "7785",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1633/123689.jpg",
            "link": "https://myanimelist.net/anime/7785/Yojouhan_Shinwa_Taikei",
            "ranking": 85,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1633/123689.jpg?s=6d15cd9c92692a0972c789132792888c",
            "title": "Yojouhan Shinwa Taikei",
            "hasRanking": true,
            "alternativeTitles": [
                "Yojo-Han Shinwa Taikei",
                "Yojou-Han Shinwa Taikei",
                "Yojohan Shinwa Taikei",
                "四畳半神話大系",
                "The Tatami Galaxy",
                "Tatami Galaxy",
                "The Tatami Galaxy",
                "The Tatami Galaxy"
            ],
            "episodes": 11,
            "genres": [
                "Comedy",
                "Mystery",
                "Romance"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "One autumn evening at a mysterious ramen stand behind the Shimogamo Shrine, a lonely third-year college student bumps into a man with an eggplant-shaped head who calls himself a god of matrimony. Meeting this man causes the student to reflect upon his past two years at college—two years bitterly spent trying to break up couples on campus with his only friend Ozu, a ghoulish-looking man seemingly set on making his life as miserable as possible. Resolving to make the most out of the rest of his college life, the student attempts to ask out the unsociable but kind-hearted underclassman Akashi, yet fails to follow through, prompting him to regret not living out his college life differently. As soon as this thought passes through his head, however, he is hurtled through time and space to the beginning of his years at college and given another chance to live his life.\n\nSurreal, artistic, and mind-bending, Yojouhan Shinwa Taikei chronicles the misadventures of a young man on a journey to make friends, find love, and experience the rose-colored campus life he always dreamed of.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "40417",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1972/111635.jpg",
            "link": "https://myanimelist.net/anime/40417/Fruits_Basket_2nd_Season",
            "ranking": 86,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1972/111635.jpg?s=9f6f5fa524e70efe80167f14f18b9163",
            "title": "Fruits Basket 2nd Season",
            "hasRanking": true,
            "alternativeTitles": [
                "Fruits Basket (2019) 2nd Season",
                "Furuba",
                "Fruits Basket (Kouhen)",
                "フルーツバスケット 2nd season",
                "Fruits Basket Staffel 2",
                "Fruits Basket Temporada 2",
                "Fruits Basket Sasion 2"
            ],
            "episodes": 25,
            "genres": [
                "Drama",
                "Romance",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "A year has passed since Tooru Honda began living in the Souma residence, and she has since created stronger relationships with its inhabitants Shigure, Kyou, and Yuki. She has also grown closer to the rest of the Souma family and has become familiar with their ancestral secret, having helped them with many of their personal issues. The closer Tooru gets, however, the more she begins to realize that their secret holds a darker truth than she first presumed.\n\nSummer is approaching and Tooru is invited to spend her days with the Soumas, mainly Kyou and Yuki. Tooru wishes for an easy-going vacation, but her close relationships with the two boys and the rest of the Soumas may prove to cause trouble. As they grow more intimate, their carefree time together is hindered by older hardships and feelings from the past that begin to resurface. The Eternal Banquet also dawns on the members of the zodiac, and they must tend to their duties alongside the unnerving head of the family, Akito Souma.\n\nWith the banquet approaching and a plethora of feelings to be solved, will Tooru's life with the Soumas remain peaceful, or will she find herself in a situation from which she cannot escape?\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "36098",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1768/93291.jpg",
            "link": "https://myanimelist.net/anime/36098/Kimi_no_Suizou_wo_Tabetai",
            "ranking": 87,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1768/93291.jpg?s=9511a058515d30808733fff309b97756",
            "title": "Kimi no Suizou wo Tabetai",
            "hasRanking": true,
            "alternativeTitles": [
                "KimiSui",
                "Let Me Eat Your Pancreas",
                "君の膵臓をたべたい",
                "I Want To Eat Your Pancreas",
                "I Want To Eat Your Pancreas",
                "Quiero comerme tu Páncreas",
                "Je Veux Manger Ton Pancréas"
            ],
            "episodes": 1,
            "genres": [
                "Drama",
                "Romance",
                "Slice of Life"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "The aloof protagonist: a bookworm who is deeply detached from the world he resides in. He has no interest in others and is firmly convinced that nobody has any interest in him either. His story begins when he stumbles across a handwritten book, titled \"Living with Dying.\" He soon identifies it as a secret diary belonging to his popular, bubbly classmate Sakura Yamauchi. She then confides in him about the pancreatic disease she is suffering from and that her time left is finite. Only her family knows about her terminal illness; not even her best friends are aware. Despite this revelation, he shows zero sympathy for her plight, but caught in the waves of Sakura's persistent buoyancy, he eventually concedes to accompanying her for her remaining days.\n\nAs the pair of polar opposites interact, their connection strengthens, interweaving through their choices made with each passing day. Her apparent nonchalance and unpredictability disrupts the protagonist's impassive flow of life, gradually opening his heart as he discovers and embraces the true meaning of living.\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "11741",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1522/117645.jpg",
            "link": "https://myanimelist.net/anime/11741/Fate_Zero_2nd_Season",
            "ranking": 88,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1522/117645.jpg?s=e54dcf99dc0874bc5b228ebe8496c857",
            "title": "Fate/Zero 2nd Season",
            "hasRanking": true,
            "alternativeTitles": [
                "Fate/Zero Second Season",
                "フェイト/ゼロ 2ndシーズン",
                "Fate/Zero Season 2",
                "Fate/Zero Staffel 2",
                "Fate/Zero Temporada 2",
                "Fate Zero Saison 2"
            ],
            "episodes": 12,
            "genres": [
                "Action",
                "Fantasy",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "As the Fourth Holy Grail War rages on with no clear victor in sight, the remaining Servants and their Masters are called upon by Church supervisor Risei Kotomine, in order to band together and confront an impending threat that could unravel the Grail War and bring about the destruction of Fuyuki City. The uneasy truce soon collapses as Masters demonstrate that they will do anything in their power, no matter how despicable, to win.\n\nSeeds of doubt are sown between Kiritsugu Emiya and Saber, his Servant, as their conflicting ideologies on heroism and chivalry clash. Meanwhile, an ominous bond forms between Kirei Kotomine, who still seeks to find his purpose in life, and one of the remaining Servants. As the countdown to the end of the war reaches zero, the cost of winning begins to blur the line between victory and defeat.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "38000",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1286/99889.jpg",
            "link": "https://myanimelist.net/anime/38000/Kimetsu_no_Yaiba",
            "ranking": 89,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1286/99889.jpg?s=e497d08bef31ae412e314b90a54acfda",
            "title": "Kimetsu no Yaiba",
            "hasRanking": true,
            "alternativeTitles": [
                "Blade of Demon Destruction",
                "鬼滅の刃",
                "Demon Slayer: Kimetsu no Yaiba",
                "Demon Slayer",
                "Guardianes De La Noche: Kimetsu no Yaiba",
                "Demon Slayer"
            ],
            "episodes": 26,
            "genres": [
                "Action",
                "Fantasy"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Ever since the death of his father, the burden of supporting the family has fallen upon Tanjirou Kamado's shoulders. Though living impoverished on a remote mountain, the Kamado family are able to enjoy a relatively peaceful and happy life. One day, Tanjirou decides to go down to the local village to make a little money selling charcoal. On his way back, night falls, forcing Tanjirou to take shelter in the house of a strange man, who warns him of the existence of flesh-eating demons that lurk in the woods at night.\n\nWhen he finally arrives back home the next day, he is met with a horrifying sight—his whole family has been slaughtered. Worse still, the sole survivor is his sister Nezuko, who has been turned into a bloodthirsty demon. Consumed by rage and hatred, Tanjirou swears to avenge his family and stay by his only remaining sibling. Alongside the mysterious group calling themselves the Demon Slayer Corps, Tanjirou will do whatever it takes to slay the demons and protect the remnants of his beloved sister's humanity.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "21329",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/10/59315.jpg",
            "link": "https://myanimelist.net/anime/21329/Mushishi__Hihamukage",
            "ranking": 90,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/10/59315.jpg?s=a45594e7790d4a09b63722ca901cff1c",
            "title": "Mushishi: Hihamukage",
            "hasRanking": true,
            "alternativeTitles": [
                "Mushi-shi Tokubetsu-hen: Hihamu Kage",
                "Mushishi Special: Hihamukage",
                "蟲師 特別篇「日蝕む翳」",
                "Mushi-shi: The Shadow that Devours the Sun"
            ],
            "episodes": 1,
            "genres": [
                "Adventure",
                "Fantasy",
                "Mystery",
                "Slice of Life",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "The entire countryside comes to a halt midday to witness a rare solar eclipse that is rumored to allow the average person to see Mushi. Unable to avert their gaze, the air is full of awe and wonder—but those who know the Mushi are preparing for the eclipse's aftermath.\n\nBased on a prediction from Tanyuu Karibusa, the cursed recorder, Mushishi Ginko finds himself in a very unlucky farming village. Immediately following the solar eclipse, a strange black cloud begins to gather in the sky and blocks the sun once more. Suspecting it to be the work of a Mushi known as Hihami, Ginko seeks to liberate the village from perpetual darkness. However, it seems that not all of the villagers are eager to return to the light.\n\n[Written by MAL Rewrite]",
            "type": "Special"
        },
        {
            "_id": "32",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1404/98182.jpg",
            "link": "https://myanimelist.net/anime/32/Neon_Genesis_Evangelion__The_End_of_Evangelion",
            "ranking": 91,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1404/98182.jpg?s=890ec3587370861a797eb6b38b2ef21a",
            "title": "Neon Genesis Evangelion: The End of Evangelion",
            "hasRanking": true,
            "alternativeTitles": [
                "Shinseiki Evangelion Gekijouban: The End of Evangelion",
                "新世紀エヴァンゲリオン劇場版 THE END OF EVANGELION",
                "Neon Genesis Evangelion: The End of Evangelion"
            ],
            "episodes": 1,
            "genres": [
                "Avant Garde",
                "Drama",
                "Sci-Fi"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Shinji Ikari is left emotionally comatose after the death of a dear friend. With his son mentally unable to pilot the humanoid robot Evangelion Unit-01, Gendou Ikari's NERV races against the shadow organization SEELE to see who can enact their ultimate plan first. SEELE desires to create a godlike being by fusing their own souls into an Evangelion unit, while Gendou wishes to revert all of humanity into one primordial being so that he can be reunited with Yui, his deceased wife.\n\nSEELE unleashes its military forces in a lethal invasion of NERV headquarters. As SEELE's forces cut down NERV's scientists and security personnel, Asuka Langley Souryuu pilots Evangelion Unit-02 in a desperate last stand against SEELE's heaviest weaponry.\n\nThe battle rages on, and a depressed Shinji hides deep within NERV's headquarters. With the fate of the world resting in Shinji's hands, Captain Misato Katsuragi hunts for the teenage boy as society crumbles around them.\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "40664",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1378/119190.jpg",
            "link": "https://myanimelist.net/anime/40664/Shoujo%E2%98%86Kageki_Revue_Starlight_Movie",
            "ranking": 92,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1378/119190.jpg?s=efa94668d516b81db418e026af363dae",
            "title": "Shoujo☆Kageki Revue Starlight Movie",
            "hasRanking": true,
            "alternativeTitles": [
                "劇場版 少女☆歌劇 レヴュースタァライト"
            ],
            "episodes": 1,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "\"Starlight\" - it's a distant star, long ago, and in the far future. Two girls, who were struck by the light of the stage in this play, exchanged their destinies.\n\n\"Two people's stars, waiting on stage.\"\n\nTo burn out ordinary fun and joy and fulfill our destinies. A destiny to become a blast furnace at just 5 years old... what a danger.\n\nEventually the two will meet again. One continued to stand on the stage of tragedy, the other jumped in, separated, jumped in, rewrote their destinies... and created a new chapter full of light.\n\nNo girl was burned and fell from the tower, nor was she imprisoned. Then... what is the end of that new chapter?\n\n\"Starlight\" is a story of an unknown author. Where does the light come from and where does it go? And who is \"starring\" in this story?\n\nI want to see it.\n\nHey -- Hanako Aishiro, a third-year student at Seisho Music Academy?\n\n(Source: Official website)",
            "type": "Movie"
        },
        {
            "_id": "5300",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/4/79738.jpg",
            "link": "https://myanimelist.net/anime/5300/Zoku_Natsume_Yuujinchou",
            "ranking": 93,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/4/79738.jpg?s=dbd5bb99becb12fa6d689196afefa1ff",
            "title": "Zoku Natsume Yuujinchou",
            "hasRanking": true,
            "alternativeTitles": [
                "Natsume Yuujinchou Two",
                "Natsume Yuujinchou 2",
                "Natsume Yujincho 2",
                "続 夏目友人帳",
                "Natsume's Book of Friends Season 2"
            ],
            "episodes": 13,
            "genres": [
                "Drama",
                "Slice of Life",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "As with its prequel, Zoku Natsume Yuujinchou is about Takashi Natsume, a boy who has had the ability to see youkai since he was young, and his bodyguard youkai Madara, nicknamed Nyanko-sensei. Natsume attempts to return names written in his \"Book of Friends\" (which he inherited from his grandmother Reiko) to youkai in his village. Throughout these adventures, he meets some youkai that are friendly, some that want to steal the Book, and some that want to kill him, as Natsume learns about himself and his relationship with these mysterious beings along the way.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "170",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/12/86890.jpg",
            "link": "https://myanimelist.net/anime/170/Slam_Dunk",
            "ranking": 94,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/12/86890.jpg?s=bfc7954502569ff5c4d3533dcde8230f",
            "title": "Slam Dunk",
            "hasRanking": true,
            "alternativeTitles": [
                "スラムダンク",
                "Slam Dunk"
            ],
            "episodes": 101,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Hanamichi Sakuragi, infamous for his temper, massive height, and fire-red hair, enrolls in Shohoku High, hoping to finally get a girlfriend and break his record of being rejected 50 consecutive times in middle school. His notoriety precedes him, however, leading to him being avoided by most students. Soon, after certain events, Hanamichi is left with two unwavering thoughts: \"I hate basketball,\" and \"I desperately need a girlfriend.\"\n\nOne day, a girl named Haruko Akagi approaches him without any knowledge of his troublemaking ways and asks him if he likes basketball. Hanamichi immediately falls head over heels in love with her, blurting out a fervent affirmative. She then leads him to the gymnasium, where she asks him if he can do a slam dunk. In an attempt to impress Haruko, he makes the leap, but overshoots, instead slamming his head straight into the blackboard. When Haruko informs the basketball team's captain of Hanamichi's near-inhuman physical capabilities, he slowly finds himself drawn into the camaraderie and competition of the sport he had previously held resentment for.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "35839",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/6/89879.jpg",
            "link": "https://myanimelist.net/anime/35839/Sora_yori_mo_Tooi_Basho",
            "ranking": 95,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/89879.jpg?s=273f1505d409ac20eed3e0c255a2f903",
            "title": "Sora yori mo Tooi Basho",
            "hasRanking": true,
            "alternativeTitles": [
                "Uchuu yori mo Tooi Basho",
                "A Story That Leads to the Antarctica",
                "Yorimoi",
                "宇宙よりも遠い場所",
                "A Place Further Than The Universe",
                "A Place Further Than the Universe",
                "A Place Further than the Universe",
                "A Place Further Than The Universe"
            ],
            "episodes": 13,
            "genres": [
                "Adventure",
                "Comedy",
                "Drama"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Filled with an overwhelming sense of wonder for the world around her, Mari Tamaki has always dreamt of what lies beyond the reaches of the universe. However, despite harboring such large aspirations on the inside, her fear of the unknown and anxiety over her own possible limitations have always held her back from chasing them. But now, in her second year of high school, Mari is more determined than ever to not let any more of her youth go to waste. Still, her fear continues to prevent her from taking that ambitious step forward—that is, until she has a chance encounter with a girl who has grand dreams of her own.\n\nSpurred by her mother's disappearance, Shirase Kobuchizawa has been working hard to fund her trip to Antarctica. Despite facing doubt and ridicule from virtually everyone, Shirase is determined to embark on this expedition to search for her mother in a place further than the universe itself. Inspired by Shirase's resolve, Mari jumps at the chance to join her. Soon, their efforts attract the attention of the bubbly Hinata Miyake, who is eager to stand out, and Yuzuki Shiraishi, a polite girl from a high class background. Together, they set sail toward the frozen south.\n\nSora yori mo Tooi Basho follows the captivating journey of four spirited girls, all in search of something great.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "37779",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1830/118780.jpg",
            "link": "https://myanimelist.net/anime/37779/Yakusoku_no_Neverland",
            "ranking": 96,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1830/118780.jpg?s=4e8a1b5b13b15d3c9172d53e3aad887b",
            "title": "Yakusoku no Neverland",
            "hasRanking": true,
            "alternativeTitles": [
                "約束のネバーランド",
                "The Promised Neverland",
                "The Promised Neverland",
                "The Promised Neverland",
                "The Promised Neverland"
            ],
            "episodes": 12,
            "genres": [
                "Mystery",
                "Sci-Fi",
                "Suspense"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Surrounded by a forest and a gated entrance, the Grace Field House is inhabited by orphans happily living together as one big family, looked after by their \"Mama,\" Isabella. Although they are required to take tests daily, the children are free to spend their time as they see fit, usually playing outside, as long as they do not venture too far from the orphanage—a rule they are expected to follow no matter what. However, all good times must come to an end, as every few months, a child is adopted and sent to live with their new family, never to be heard from again.\n\nHowever, the three oldest siblings have their suspicions about what is actually happening at the orphanage, and they are about to discover the cruel fate that awaits the children living at Grace Field, including the twisted nature of their beloved Mama.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "12365",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/6/41845.jpg",
            "link": "https://myanimelist.net/anime/12365/Bakuman_3rd_Season",
            "ranking": 97,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/6/41845.jpg?s=3e8c09dddfce41e17d602c0cd81875e1",
            "title": "Bakuman. 3rd Season",
            "hasRanking": true,
            "alternativeTitles": [
                "Bakuman Season 3",
                "バクマン。",
                "Bakuman Season 3"
            ],
            "episodes": 25,
            "genres": [
                "Comedy",
                "Drama",
                "Romance"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Onto their third serialization, manga duo Moritaka Mashiro and Akito Takagi—also known by their pen name, Muto Ashirogi—are ever closer to their dream of an anime adaption. However, the real challenge is only just beginning: if they are unable to compete with the artist Eiji Niizuma in the rankings within the span of six months, they will be canceled. To top it off, numerous rivals are close behind and declaring war. They don't even have enough time to spare thinking about an anime!\n\nIn Bakuman. 3rd Season, Muto Ashirogi must find a way to stay atop the colossal mountain known as the Shounen Jack rankings. With new problems and new assistants, the pair continue to strive for their dream.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "40776",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1453/106768.jpg",
            "link": "https://myanimelist.net/anime/40776/Haikyuu_To_the_Top_Part_2",
            "ranking": 98,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1453/106768.jpg?s=08662a9ed32a8637dbdfa92f67949078",
            "title": "Haikyuu!! To the Top Part 2",
            "hasRanking": true,
            "alternativeTitles": [
                "Haikyu!! TO THE TOP 2nd-cour",
                "Haikyu!! TO THE TOP Part 2",
                "ハイキュー TO THE TOP 第2クール",
                "Haikyu!! TO THE TOP 2nd-cour",
                "Haikyu!! Vierte Staffel 4",
                "Haikyu!! Los Ases del Vóley Temporada 4",
                "Haikyu!! Saison 4 Cour 2"
            ],
            "episodes": 12,
            "genres": [],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Once called a fallen powerhouse and known as \"Flightless Crows,\" Karasuno High School has finally taken flight at nationals. With a comprehensive performance against Tsubakihara Academy in their first match, the team is now facing its toughest opponent yet: the runners-up of the last Spring Tournament, Inarizaki High School. Furthermore, dealing with the formidable twin Miya brothers only makes things more difficult for Karasuno.\n\nAs soon as the match begins, Karasuno is overwhelmed by all the noise and jeers from the supporters of Inarizaki High but rekindles its strength thanks to its own loyal fans. Karasuno also gains some momentum by utilizing an attack centered on Shouyou Hinata, but the eccentric play of Atsumu and Osamu Miya delivers an unexpected blow that leaves their opponent astounded.\n\nThings are bound to get intense as the match progresses between these two teams. Will Karasuno be able to defeat Inarizaki High and overcome the hurdles that threaten its pursuit to the top?\n\n[Written by MAL Rewrite]",
            "type": "TV"
        },
        {
            "_id": "4282",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1574/112838.jpg",
            "link": "https://myanimelist.net/anime/4282/Kara_no_Kyoukai_Movie_5__Mujun_Rasen",
            "ranking": 99,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1574/112838.jpg?s=58d26fa18ddfe934b6795cf787d418b9",
            "title": "Kara no Kyoukai Movie 5: Mujun Rasen",
            "hasRanking": true,
            "alternativeTitles": [
                "Kara no Kyoukai: The Garden of Sinners Movie 5",
                "Borderline of Emptiness: Paradox Spiral",
                "The Garden of Sinners: Paradox Paradigm",
                "劇場版 空の境界 the Garden of sinners 第五章『矛盾螺旋』",
                "the Garden of sinners Chapter 5: Paradox Paradigm",
                "the Garden of Sinners Film 5: Paradoxe Helix",
                "the Garden of sinners Film 5: Spirale Contradictoire"
            ],
            "episodes": 1,
            "genres": [
                "Action",
                "Drama",
                "Mystery",
                "Romance",
                "Supernatural",
                "Suspense"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "In November 1998, a double homicide occurs at the newly constructed Ogawa apartment complex in the heart of Mifune City. The murderer, Tomoe Enjou, has fled in a panic. To his astonishment, he is not pursued by the police and news of the incident has not been reported through media outlets. After Shiki Ryougi defends Tomoe from a group of thugs, she allows him to use her residence as a hideout. However, a few days later, Tomoe is shaken to discover that his mother is alive, even though he is convinced that he killed her.\n \nCoincidentally, Mikiya Kokutou is investigating a tip that his associate Touko Aozaki receives regarding the murder at the unique apartment complex. As he uncovers more information about the incident, Mikiya takes a particular interest in Tomoe. Deciding to investigate him further, Mikiya soon discovers the disturbing truth of the foreboding Ogawa complex.\n\nThe fifth installment of the Kara no Kyoukai film series, Mujun Rasen combines an intricately constructed mystery with established themes and characters to produce a dark, thought-provoking story.\n\n[Written by MAL Rewrite]",
            "type": "Movie"
        },
        {
            "_id": "33",
            "__v": 1,
            "image": "https://cdn.myanimelist.net/images/anime/1384/119988.jpg",
            "link": "https://myanimelist.net/anime/33/Kenpuu_Denki_Berserk",
            "ranking": 100,
            "thumb": "https://cdn.myanimelist.net/r/50x70/images/anime/1384/119988.jpg?s=9260c7baa7b55d81d9f6375b55a803e6",
            "title": "Kenpuu Denki Berserk",
            "hasRanking": true,
            "alternativeTitles": [
                "Berserk: The Chronicles of Wind Blades",
                "Sword-Wind Chronicle Berserk",
                "剣風伝奇ベルセルク",
                "Berserk",
                "Berserk",
                "Berserk",
                "Berserk"
            ],
            "episodes": 25,
            "genres": [
                "Action",
                "Adventure",
                "Drama",
                "Fantasy",
                "Horror",
                "Supernatural"
            ],
            "hasEpisode": true,
            "status": "Finished Airing",
            "synopsis": "Guts, a man who will one day be known as the Black Swordsman, is a young traveling mercenary characterized by the large greatsword he carries. He accepts jobs that offer the most money, but he never stays with one group for long—until he encounters the Band of the Hawk. Ambushed after completing a job, Guts crushes many of its members in combat. Griffith, The Band of the Falcon's leader and founder, takes an interest in Guts and duels him. While the others are no match for Guts, Griffith defeats him in one blow.\n\nIncapacitated and taken into the Band of the Hawk's camp to recover, Guts wakes up two days later. He confronts Griffith, and the two duel yet again, only this time with a condition: Guts will join the Band of the Falcon if he loses. Due to his fresh injuries, Guts loses the fight and is inducted by Griffith.\n\nIn three years' time, Guts has become one of the Band of the Hawk's commanders. On the battlefield, his combat prowess is second only to Griffith as he takes on large groups of enemies all on his own. With Guts' immense strength and Griffith's leadership, the Band of the Hawk dominate every battle they partake in. But something menacing lurks in the shadows, threatening to change Guts' life forever.\n\n[Written by MAL Rewrite]",
            "type": "TV"
        }
    ],
    "meta": {
        "size": 30,
        "totalData": 100,
        "totalPage": 4
    }
}

